Repository: bzg/worg
Catalog: orgguide/orgguide.*.po
Languages: es

source: Produce a list of all headlines that match a given set of tags. The command prompts for a selection criterion, which is a boolean logic expression with tags, like @samp{+work+urgent-withboss} or @samp{work|home} (@pxref{Tags}). If you often need a specific search, define a custom command for it (@pxref{Agenda dispatcher}).
es: Se produce una lista de todas las cabeceras que coinciden con un conjunto dado de etiquetas. El comando pregunta por un criterio de selecci@'on, que es una expresi@'on de l@'ogica booleana con etiquetas, como @samp{+work+urgent-withboss} o @samp{work|home} (@pxref{Etiquetas}). Si con frecuencia se necesita una b@'usqueda espec@'{@dotless{i}}fica, define un comando personalizado para ello (@pxref{El disparador de la agenda}).

source: Like @kbd{C-c a m}, but only select headlines that are also TODO items.
es: Como @kbd{C-c a m}, pero solo selecciona cabeceras que son tambi@'en @'{@dotless{i}}tems TODO.

source: Match syntax
es: Emparejar sintaxis

source: A search string can use Boolean operators @samp{&} for AND and @samp{|} for OR. @samp{&} binds more strongly than @samp{|}. Parentheses are currently not implemented. Each element in the search is either a tag, a regular expression matching tags, or an expression like @code{PROPERTY OPERATOR VALUE} with a comparison operator, accessing a property value. Each element may be preceded by @samp{-}, to select against it, and @samp{+} is syntactic sugar for positive selection. The AND operator @samp{&} is optional when @samp{+} or @samp{-} is present. Here are some examples, using only tags.
es: Una cadena de b@'usqueda puede usar operadores booleanos @samp{&} para AND y @samp{|} para OR. @samp{&} es m@'as fuerte que @samp{|}. Los par@'entesis no est@'an actualmente implementados. Cada elemento en la b@'usqueda es una etiqueta, o una expresi@'on como @code{PROPIEDAD OPERADOR VALOR} con un operador de comparaci@'on, que accede al valor de la propiedad. Cada elemento puede ser precedido por @samp{-}, para eliminar la selecci@'on, y @samp{+} que es az@'ucar sint@'actico para la selecci@'on positiva. El operador AND @samp{&} es opcional cuando @samp{+} o @samp{-} est@'an presentes. Aqu@'{@dotless{i}} hay algunos ejemplos, usando solo etiquetas (@emph{tags}).

source: Select headlines tagged @samp{:work:}, but discard those also tagged @samp{:boss:}.
es: Selecciona las l@'{@dotless{i}}neas de cabecera etiquetadas como @samp{:trabajo:}, pero descarta estas tambi@'en etiquetadas como @samp{:jefe:}.

source: work|laptop
es: trabajo|port@'atil

source: Selects lines tagged @samp{:work:} or @samp{:laptop:}.
es: Selecciona l@'{@dotless{i}}neas etiquetadas como @samp{:trabajo:} o @samp{:port@'atil}.

source: work|laptop+night
es: trabajo|escritorio+noche

source: Like before, but require the @samp{:laptop:} lines to be tagged also @samp{:night:}.
es: Como antes, pero requiere las l@'{@dotless{i}}neas @samp{:port@'atil:} para ser etiquetado tambi@'en como @samp{:noche:}.

source: You may also test for properties at the same time as matching tags, see the manual for more information.
es: Se pueden tambi@'en chequear propiedades al mismo tiempo que se chequea si coinciden etiquetas (@emph{tags}), ver el manual para m@'as informaci@'on.

source: Timeline for a single file
es: L@'{@dotless{i}}nea de tiempo para un simple archivo

source: The timeline summarizes all time-stamped items from a single Org mode file in a @emph{time-sorted view}. The main purpose of this command is to give an overview over events in a project.
es: La l@'{@dotless{i}}nea de tiempo resume todos los @'{@dotless{i}}tems de marca de tiempo desde un simple fichero Org mode en una @emph{vista de tiempo ordenada}. El prop@'osito principal de este comando es dar una vista general a trav@'es de eventos en un proyecto.

source: Show a time-sorted view of the Org file, with all time-stamped items. When called with a @kbd{C-u} prefix, all unfinished TODO entries (scheduled or not) are also listed under the current date.
es: emparejando

source: This agenda view is a general text search facility for Org mode entries. It is particularly useful to find notes.
es: Esta vista de agenda es una facilidad de b@'usqueda general de texto para entradas Org mode. Eso es particularmente @'util para encontrar notas.

source: This is a special search that lets you select entries by matching a substring or specific words using a boolean logic.
es: Esto es una b@'usqueda especial que te permite seleccionar entradas emparejando una subcadena o palabras espec@'{@dotless{i}}ficas usando l@'ogica booleana.

source: For example, the search string @samp{computer equipment} will find entries that contain @samp{computer equipment} as a substring. Search view can also search for specific keywords in the entry, using Boolean logic. The search string @samp{+computer +wifi -ethernet -@{8\.11[bg]@}} will search for note entries that contain the keywords @code{computer} and @code{wifi}, but not the keyword @code{ethernet}, and which are also not matched by the regular expression @code{8\.11[bg]}, meaning to exclude both 8.11b and 8.11g.
es: Por ejemplo, la cadena de b@'usqueda @samp{equipamiento del ordenador} encontrar@'a entradas que contienen @samp{equipamiento del ordenador} como una subcadena. La b@'usqueda tambi@'en puede encontrar palabras clave espec@'{@dotless{i}}ficas en la entrada, usando l@'ogica booleana. La cadena de b@'usqueda @samp{+ordenador +wifi -ethernet -@{8.11[bg]@}} encontrar@'a entradas que contengan las palabras clave @code{ordenador} y @code{wifi}, pero no las palabras clave @code{ethernet}, y que tampoco concuerdan con la expresi@'on regular @code{8.11[bg]}, que significa excluir tanto 8.11b y 8.11g.

source: Note that in addition to the agenda files, this command will also search the files listed in @code{org-agenda-text-search-extra-files}.
es: N@'otese que adem@'as a los ficheros de agenda, este comando tambi@'en buscar@'a los ficheros listados en @code{org-agenda-text-search-extra-files}.

source: Commands in the agenda buffer
es: Comandos en el b@'uffer de agenda

source: Entries in the agenda buffer are linked back to the Org file or diary file where they originate. Commands are provided to show and jump to the original entry location, and to edit the Org files ``remotely'' from the agenda buffer. This is just a selection of the many commands, explore the @code{Agenda} menu and the manual for a complete list.
es: Las entradas en el b@'uffer de agenda est@'an enlazadas al fichero Org o el fichero de diario d@'onde ellos lo originan. Los comandos est@'an provistos para mostrar y saltar a la localizaci@'on de la entrada original, y editar los ficheros Org ``remotamente'' desde el b@'uffer de la agenda. Esto es solo una selecci@'on de los muchos comandos, explora el men@'u de la @code{Agenda} y el manual para una lista completa.

source: @tsubheading{Motion}
es: @tsubheading{Movimiento}

source: Next line (same as @key{up} and @kbd{C-p}).
es: Siguiente l@'{@dotless{i}}nea (igual que @key{arriba} y @kbd{C-p}).

source: Previous line (same as @key{down} and @kbd{C-n}). @tsubheading{View/Go to Org file}
es: La l@'{@dotless{i}}nea previa (igual que @key{abajo} y @kbd{C-n}). @tsubheading{Vista/Ir al fichero Org}

source: Display the original location of the item in another window. With prefix arg, make sure that the entire entry is made visible in the outline, not only the heading.
es: Muestra la localizaci@'on original del @'{@dotless{i}}tem en otra ventana. Con el prefijo arg, aseg@'urese que la entrada entera se hace visible en el outline y, no solo en la cabecera.

source: Go to the original location of the item in another window. Under Emacs 22, @kbd{mouse-1} will also work for this.
es: Ir a la localizaci@'on original de los @'{@dotless{i}}tems en otra ventana. Bajo Emacs 22 @kbd{mouse-1} tambi@'en funciona para esto.

source: Go to the original location of the item and delete other windows.
es: Ir a la localizaci@'on original del @'{@dotless{i}}tem y borra otras ventanas.

source: @tsubheading{Change display}
es: @tsubheading{Cambiar la visualizaci@'on}

source: Delete other windows.
es: Borra otras ventanas.

source: Switch to day/week view.
es: Cambiar a la vista de d@'{@dotless{i}}a/semana.

source: f @r{and} b
es: f @r{y} b

source: Go forward/backward in time to display the following @code{org-agenda-current-span} days. For example, if the display covers a week, switch to the following/previous week.
es: Ir hacia delante o hacia atr@'as en el tiempo para mostrar los siguientes d@'{@dotless{i}}as @code{org-agenda-current-span}. Por ejemplo, si el display cubre una semana, cambia la siguiente o previa semana.

source: Go to today.
es: Ir a hoy.

source: Prompt for a date and go there.
es: Pregunta por una fecha y va all@'{@dotless{i}}.

source: v l @ @r{or short} @ l
es: v l @ @r{u ordena} @ l

source: Toggle Logbook mode. In Logbook mode, entries that were marked DONE while logging was on (variable @code{org-log-done}) are shown in the agenda, as are entries that have been clocked on that day. When called with a @kbd{C-u} prefix, show all possible logbook entries, including state changes.
es: Cambia al modo Logbook. En el modo Logbook, las entradas que se marcan como DONE (dada la variable @code{org-log-done}), se muestran en la agenda, como entradas que han sido organizadas en este d@'{@dotless{i}}a. Cuando se llama con un prefijo @kbd{C-u}, se muestran todas las posibles entradas logbook, incluyendo cambios estado.

source: r @r{or} g
es: r @r{o} g

source: Recreate the agenda buffer, to reflect the changes.
es: Recrear el b@'uffer de agenda, para reflejar los cambios.

source: Save all Org buffers in the current Emacs session, and also the locations of IDs.
es: Salva todos los b@'uffers Org en la sesi@'on Emacs actual, y tambi@'en las localizaciones de IDs.

source: @tsubheading{Secondary filtering and query editing}
es: @tsubheading{Filtro secundario y buscar la edici@'on}

source: Filter the current agenda view with respect to a tag. You are prompted for a letter to select a tag. Press @samp{-} first to select against the tag.
es: Filtra la vista de agenda actual con respecto a una etiqueta. Se pregunta por una letra para seleccionar una etiqueta. Presiona @samp{-} primero para seleccionar la etiqueta.

source: Narrow the current agenda filter by an additional condition.
es: Minimiza el filtro de la agenda actual por una condici@'on adicional.

source: @tsubheading{Remote editing (see the manual for many more commands)}
es: @tsubheading{Edici@'on remota (ver el manual para muchos m@'as comandos)}

source: Digit argument.
es: Argumento d@'{@dotless{i}}gito.

source: Change the TODO state of the item, in the agenda and in the org file.
es: Cambia el estado TODO del @'{@dotless{i}}tem, en la agenda en el fichero org.

source: Delete the current agenda item along with the entire subtree belonging to it in the original Org file.
es: Borra el @'{@dotless{i}}tem de la agenda actual a lo largo con el sub@'arbol perteneciente a ello en el fichero Org original.

source: Refile the entry at point.
es: Rellena la entrada a punto.

source: C-c C-x C-a @ @r{or short} @ a
es: C-c C-x C-a @ @r{u ordena} @ a

source: Archive the subtree corresponding to the entry at point using the default archiving command set in @code{org-archive-default-command}.
es: Archivar el sub@'arbol correspondiente a la entrada a punto usando el comando de archivaci@'on establecido en @code{org-archive-default-command}.

source: C-c C-x C-s @ @r{or short} @ $
es: C-c C-x C-s @ @r{u ordena} @ $

source: Archive the subtree corresponding to the current headline.
es: Archiva el sub@'arbol correspondiente a la actual cabecera.

source: Schedule this item, with prefix arg remove the scheduling timestamp
es: Planifica este @'{@dotless{i}}tem, con argumento prefijo borra la marca de tiempo planificada.

source: Set a deadline for this item, with prefix arg remove the deadline.
es: Asigna una fecha l@'{@dotless{i}}mite para este @'{@dotless{i}}tem, con el argumento prefijo elimina la fecha l@'{@dotless{i}}mite.

source: S-@key{right} @r{and} S-@key{left}
es: S-@key{derecha}@r{/}@key{izquierda}

source: Change the timestamp associated with the current line by one day.
es: Cambia la marca de tiempo asociada con la l@'{@dotless{i}}nea actual por un d@'{@dotless{i}}a.

source: Start the clock on the current item.
es: Empieza el cron@'ometro en el @'{@dotless{i}}tem actual.

source: Stop/cancel the previously started clock.
es: Para/cancela el reloj previamente iniciado.

source: Jump to the running clock in another window.
es: Salta al reloj en ejecuci@'on a otra ventana.

source: The main application of custom searches is the definition of keyboard shortcuts for frequently used searches, either creating an agenda buffer, or a sparse tree (the latter covering of course only the current buffer). Custom commands are configured in the variable @code{org-agenda-custom-commands}. You can customize this variable, for example by pressing @kbd{C-c a C}. You can also directly set it with Emacs Lisp in @file{.emacs}. The following example contains all valid search types:
es: La principal aplicaci@'on de las b@'usquedas personalizadas es la definici@'on de atajos de teclado para b@'usquedas usadas frecuentemente, bien creando un b@'uffer de agenda, o un @'arbol disperso (el @'ultimo que cubre de acuerdo solo al b@'uffer actual). Los comandos personalizados son configurados en la variable @code{org-agenda-custom-commands}. Se puede personalizar esta variable, por ejemplo, presionando @kbd{C-c a C}. Se puede tambi@'en directamente establecerlo con Emacs Lisp en @file{.emacs}. El siguiente ejemplo contiene todos los tipos de b@'usqueda v@'alida:

source: (setq org-agenda-custom-commands '(("w" todo "WAITING") ("u" tags "+boss-urgent") ("v" tags-todo "+boss-urgent")))
es: (setq org-agenda-custom-commands '(("w" todo "ESPERANDO") ("u" tags "+jefe-urgente") ("v" tags-todo "+jefe-urgente")))

source: The initial string in each entry defines the keys you have to press after the dispatcher command @kbd{C-c a} in order to access the command. Usually this will be just a single character. The second parameter is the search type, followed by the string or regular expression to be used for the matching. The example above will therefore define:
es: La cadena inicial en cada entrada define las claves que se tienen para presionar despu@'es el comando disparador @kbd{C-c a} en orden para acceder el comando. Usualmente esto ser@'a solo un car@'acter. El segundo par@'ametro es el tipo de b@'usqueda, seguida por la cadena o expresi@'on regular para ser usada por el emparejamiento. El ejemplo de arriba adem@'as definir@'a:

source: as a global search for TODO entries with @samp{WAITING} as the TODO keyword
es: como una b@'usqueda global para entradas TODO con @samp{ESPERANDO} como la palabra clave TODO

source: as a global tags search for headlines marked @samp{:boss:} but not @samp{:urgent:}
es: como una b@'usqueda global de etiquetas para l@'{@dotless{i}}neas de cabecera @samp{:jefe:} pero no @samp{:urgente:}

source: as the same search as @kbd{C-c a u}, but limiting the search to headlines that are also TODO items
es: como la misma b@'usqueda @kbd{C-c a u}, pero limitando la b@'usqueda para l@'{@dotless{i}}neas de cabecera est@'an tambi@'en @'{@dotless{i}}tems TODO

source: @seealso{ @uref{https://orgmode.org/manual/Agenda-Views.html#Agenda-Views, Chapter 10 of the manual}@* @uref{https://orgmode.org/worg/org-tutorials/org-custom-agenda-commands.php, Mat Lundin's tutorial about custom agenda commands}@* @uref{http://www.newartisans.com/2007/08/using-org-mode-as-a-day-planner.html, John Wiegley's setup}}
es: @seealso{ @uref{https://orgmode.org/manual/Agenda-Views.html#Agenda-Views, Cap@'{@dotless{i}}tulo 10 del manual}@* @uref{https://orgmode.org/worg/org-tutorials/org-custom-agenda-commands.php, El tutorial de Mat Lundin acerca de comandos personalizados de agenda}@* @uref{http://www.newartisans.com/2007/08/using-org-mode-as-a-day-planner.html, Configuraci@'on de John Wiegley}}

source: When exporting Org-mode documents, the exporter tries to reflect the structure of the document as accurately as possible in the backend. Since export targets like HTML, @LaTeX{}, or DocBook allow much richer formatting, Org mode has rules on how to prepare text for rich export. This section summarizes the markup rules used in an Org-mode buffer.
es: Cuando se exportan documentos en Org-mode, el exportador intenta reflejar la estructura del documento de manera tan precisa como sea posible en el backend. Exportar a formatos como HTML, @LaTeX{}, o DocBook permite enriquecer el formatos, Org mode tiene reglas de c@'omo preparar texto para la exportaci@'on enriquecida. Esta secci@'on resume las reglas de marcado usados en un b@'uffer Org-mode.

source: The title of the exported document is taken from the special line
es: El t@'{@dotless{i}}tulo del documento exportado es tomado desde la l@'{@dotless{i}}nea especial

source: #+TITLE: This is the title of the document
es: #+TITLE: Este es el t@'{@dotless{i}}tulo del documento

source: The outline structure of the document as described in @ref{Document Structure}, forms the basis for defining sections of the exported document. However, since the outline structure is also used for (for example) lists of tasks, only the first three outline levels will be used as headings. Deeper levels will become itemized lists. You can change the location of this switch globally by setting the variable @code{org-export-headline-levels}, or on a per-file basis with a line
es: La estructura de contorno del documento como se describe en el @ref{Estructura del documento}, forma las bases para las secciones de definici@'on de los documentos exportados. Sin embargo, desde la estructura de @emph{outline} tambi@'en se usa para (por ejemplo) listas de tareas, solo los primeros niveles del @'arbol de @emph{outline} se usan como cabeceras. Los niveles profundos llegar@'an a ser listas de @'{@dotless{i}}tems. Se puede cambiar la localizaci@'on de este cambio globalmente configurando la variable @code{org-export-headline-levels}, o en una base por fichero con una l@'{@dotless{i}}nea.

source: The table of contents is normally inserted directly before the first headline of the file.
es: La tabla de contenidos est@'a normalmente insertados directamente antes de la primera l@'{@dotless{i}}nea de cabecera del fichero.

source: #+OPTIONS: toc:2 (only to two levels in TOC) #+OPTIONS: toc:nil (no TOC at all)
es: #+OPTIONS: toc:2 (solo a dos niveles en TOC) #+OPTIONS: toc:nil (no TOC en todo)

source: Paragraphs, line breaks, and quoting
es: P@'arrafos, l@'{@dotless{i}}neas rotas y citaci@'on

source: Paragraphs are separated by at least one empty line. If you need to enforce a line break within a paragraph, use @samp{\\} at the end of a line.
es: Los p@'arrafos est@'an separados por al menos una l@'{@dotless{i}}nea vac@'{@dotless{i}}a. Si se necesita forzar una l@'{@dotless{i}}nea rota con un p@'arrafo, usa @samp{\\} al final de una l@'{@dotless{i}}nea.

source: To keep the line breaks in a region, but otherwise use normal formatting, you can use this construct, which can also be used to format poetry.
es: Para guardar la l@'{@dotless{i}}nea rota en una regi@'on, pero usar formateo normal se puede usar este constructo, que puede tambi@'en ser usado para el formato poes@'{@dotless{i}}a.

source: #+BEGIN_VERSE Great clouds overhead Tiny black birds rise and fall Snow covers Emacs
es: #+BEGIN_VERSE Grandes tormentas agitan los aires Nubes oscuras nos impiden ver Hacia el Emacs llama el deber

source: -- AlexSchroeder #+END_VERSE
es: -- DavidArroyo #+END_VERSE

source: When quoting a passage from another document, it is customary to format this as a paragraph that is indented on both the left and the right margin. You can include quotations in Org-mode documents like this:
es: Cuando se cita un pasaje desde otro documento, es un libro de usos y costumbres para formatear esto como un p@'arrafo que se pretende en ambos la izquierda y el margen derecho. Se puede incluir citas en documentos Org-mode como este:

source: #+BEGIN_QUOTE Everything should be made as simple as possible, but not any simpler -- Albert Einstein #+END_QUOTE
es: #+BEGIN_QUOTE Cada cosa deber@'{@dotless{i}}a ser hecha tan simple como sea posible, pero no simple de cualquier manera -- Albert Einstein #+END_QUOTE

source: If you would like to center some text, do it like this:
es: Si se quisiera centrar alg@'un texto, se puede hacer as@'{@dotless{i}}:

source: #+BEGIN_CENTER Everything should be made as simple as possible, \\ but not any simpler #+END_CENTER
es: #+BEGIN_CENTER Cada cosa deber@'{@dotless{i}}a hecha tan simple como posible \\ pero no simple cualquier manera #+END_CENTER

source: You can make words @b{*bold*}, @i{/italic/}, _underlined_, @code{=code=} and @code{~verbatim~}, and, if you must, @samp{+strike-through+}. Text in the code and verbatim string is not processed for Org-mode specific syntax, it is exported verbatim. To insert a horizontal rules, use a line consisting of only dashes, and at least 5 of them.
es: Se pueden crear palabras @b{*bold*}, @i{/italic/}, _underlined_, @code{=code=} and @code{~verbatim~}, y, se debe, @samp{+strike-through+}. Texto en el c@'odigo y cadena verbatim no est@'a procesada para una sintaxis espec@'{@dotless{i}}fica de Org-mode, ella es una copia literal exportada. Para insertar reglas horizontales, usan un l@'{@dotless{i}}nea que consista de solo dashes, y al menos 5 de ellos.

source: Lines starting with zero or more whitespace characters followed by @samp{#} and a whitespace are treated as comments and, as such, are not exported.
es: Las l@'{@dotless{i}}neas empezando con cero o m@'as car@'acteres de espacios en blanco seguidos por @samp{#} y un espacio en blanco se tratan como comentarios y, como tales, no se exportan.

source: Likewise, regions surrounded by @samp{#+BEGIN_COMMENT} ... @samp{#+END_COMMENT} are not exported.
es: Tambi@'en, regiones rodeadas por @samp{#+BEGIN_COMMENT} ... @samp{#+END_COMMENT} no se exportan.

source: Finally, a @samp{COMMENT} keyword at the beginning of an entry, but after any other keyword or priority cookie, comments out the entire subtree. The command below helps changing the comment status of a headline.
es: Finalmente, una palabra clave @samp{COMMENT} al principio de una entrada, pero despu@'es de cualquier otra palabra clave o prioridad, los comentarios est@'an fuera del sub@'arbol entero. El comando de debajo ayuda cambiando el estado del comentario de una cabecera.

source: Toggle the COMMENT keyword at the beginning of an entry.
es: Cambia la palabra clave COMMENT al principio de una entrada.

source: Images and Tables
es: Im@'agenes y Tablas

source: For Org mode tables, the lines before the first horizontal separator line will become table header lines. You can use the following lines somewhere before the table to assign a caption and a label for cross references, and in the text you can refer to the object with @code{[[tab:basic-data]]}:
es: Para tablas Org mode, las l@'{@dotless{i}}neas antes de la primera l@'{@dotless{i}}nea de separador horizontal llegar@'a a ser una tabla de l@'{@dotless{i}}neas cabecera. Se pueden usar las siguientes l@'{@dotless{i}}neas en alg@'un lugar antes de la tabla para asignar un caption y una etiqueta para referencias cruzadas, y en el texto se puede referir para el objeto con @code{\\ref@{tab:basic-data@}}:

source: #+CAPTION: This is the caption for the next table (or link) #+NAME: tbl:basic-data | ... | ...| |-----|----|
es: #+CAPTION: Este es el t@'{@dotless{i}}tulo para la siguiente tabla (o enlace) #+LABEL: tbl:basic-data | ... | ...| |-----|----|
