Repository: bzg/worg
Catalog: orgguide/orgguide.*.po
Languages: es

source: Enter new tags for the current headline. Org mode will either offer completion or a special single-key interface for setting tags, see below. After pressing @key{RET}, the tags will be inserted and aligned to @code{org-tags-column}. When called with a @kbd{C-u} prefix, all tags in the current buffer will be aligned to that column, just to make things look nice.
es: Introduce nuevas etiquetas para la cabecera actual. Org mode ofrecer@'a autocompletado o una interfaz especial de una sola tecla para asignar etiquetas, ver m@'as abajo. Despu@'es de presionar @key{RET}, las etiquetas ser@'an insertadas y alineadas para @code{org-tags-column}. Cuando se llama con el prefijo @kbd{C-u}, todas las etiquetas en el b@'uffer actual ser@'an alineadas a esta columna, solo para que las cosas se vean bien.

source: When the cursor is in a headline, this does the same as @kbd{C-c C-q}.
es: Cuando el cursor est@'a en una cabecera, hace lo mismo que @kbd{C-c C-q}.

source: Org will support tag insertion based on a @emph{list of tags}. By default this list is constructed dynamically, containing all tags currently used in the buffer. You may also globally specify a hard list of tags with the variable @code{org-tag-alist}. Finally you can set the default tags for a given file with lines like
es: Org soporta inserci@'on de etiquetas basado en una @emph{lista de etiquetas}. Por defecto esta lista es construida din@'amicamente, conteniendo todas las etiquetas actualmente usadas en el b@'uffer. Tambi@'en se puede especificar globalmente una lista dura de etiquetas con la variable @code{org-tag-alist}. Finalmente se puede asignar las etiquetas por defecto para un fichero dado con l@'{@dotless{i}}neas como

source: #+TAGS: @@work @@home @@tennisclub #+TAGS: laptop car pc sailboat
es: #+TAGS: @@trabajo(t) @@casa(c) @@futbol(f) servidor(s) pc(p)

source: By default Org mode uses the standard minibuffer completion facilities for entering tags. However, it also implements another, quicker, tag selection method called @emph{fast tag selection}. This allows you to select and deselect tags with just a single key press. For this to work well you should assign unique letters to most of your commonly used tags. You can do this globally by configuring the variable @code{org-tag-alist} in your @file{.emacs} file. For example, you may find the need to tag many items in different files with @samp{:@@home:}. In this case you can set something like:
es: Por defecto, Org mode usa las facilidades de compleci@'on del minib@'uffer para introducir etiquetas. Sin embargo, tambi@'en implementa otro r@'apido m@'etodo de selecci@'on de etiquetas llamado @emph{fast tag selection}. Esto permite que se seleccionen y se dejen de seleccionar etiquetas con solo presionar una sola tecla. Para que esto funcione bien se debe asignar letras @'unicas para las etiquetas m@'as usadas. Se puede hacer esto de manera global configurando la variable @code{org-tag-alist} en el fichero @file{.emacs}. Por ejemplo, se puede encontrar la necesidad de etiquetar muchos @'{@dotless{i}}tems en diferentes ficheros con @samp{:@@casa:}. En este caso se puede hacer algo como:

source: (setq org-tag-alist '(("@@work" . ?w) ("@@home" . ?h) ("laptop" . ?l)))
es: (setq org-tag-alist '(("@@trabajo" . ?t) ("@@casa" . ?c) ("portatil" . ?p)))

source: If the tag is only relevant to the file you are working on, then you can instead set the TAGS option line as:
es: Si la etiqueta @samp{tag} es solo relevante para el fichero en el que se est@'a trabajando, entonces se puede asignar la l@'{@dotless{i}}nea de opci@'on TAG de la siguiente manera:

source: #+TAGS: @@work(w) @@home(h) @@tennisclub(t) laptop(l) pc(p)
es: #+TAGS: @@trabajo(t) @@casa(c) @@futbol(f) servidor(s) pc(p)

source: group tags
es: etiquetas de grupo

source: tags, groups
es: etiquetas, grupos

source: In a set of mutually exclusive tags, the first tag can be defined as a @emph{group tag}. When you search for a group tag, it will return matches for all members in the group. In an agenda view, filtering by a group tag will display headlines tagged with at least one of the members of the group. This makes tag searches and filters even more flexible.
es: En un conjunto de etiquetas mutuamente exclusivas, la primera etiqueta puede ser definida como una @emph{etiqueta de grupo}. Cuando se busca una etiqueta de grupo, devolver@'a las coincidencias para todos los miembros en el grupo. En una vista de agenda, filtrar por una etiqueta de grupo mostrar@'a cabeceras etiquetadas con al menos uno de los miembros del grupo. Esto crea b@'usquedas y filtros incluso m@'as flexibles.

source: You can set group tags by inserting a colon between the group tag and other tags, like this:
es: Se pueden establecer grupos de etiquetas insertando un punto y coma entre la etiqueta grupo y otras etiquetas, como esta:

source: In this example, @samp{@@read} is a @emph{group tag} for a set of three tags: @samp{@@read}, @samp{@@read_book} and @samp{@@read_ebook}.
es: En este ejemplo, @samp{@@read} es una @emph{etiqueta grupo} para un conjunto de tres etiquetas: @samp{@@read}, @samp{@@read_book} y @samp{@@read_ebook}.

source: You can also use the @code{:grouptags} keyword directly when setting @var{org-tag-alist}, see the documentation of that variable.
es: Puede tambi@'en usar las palabras clave @code{:grouptags} directamente cuando se configure @var{org-tag-alist}, ver la documentaci@'on de esta variable.

source: If you want to ignore group tags temporarily, toggle group tags support with @command{org-toggle-tags-groups}, bound to @kbd{C-c C-x q}. If you want to disable tag groups completely, set @var{org-group-tags} to nil.
es: Si se quieren ignorar las etiquetas grupo temporalmente, cambia el soporte de etiquetas grupo con @command{org-toggle-tags-groups}, asociado a @kbd{C-c C-x q}. Si se quieren deshabilitar etiquetas grupos completamente, configura @var{org-group-tags} a nil.

source: Once a system of tags has been set up, it can be used to collect related information into special lists.
es: Una vez que un sistema de etiquetas ha sido configurado, puede ser usado para recoger informaci@'on dentro de listas especiales.

source: Create a sparse tree with all headlines matching a tags search. With a @kbd{C-u} prefix argument, ignore headlines that are not a TODO line.
es: Crear un @'arbol expandido con todas las cabeceras coincidentes con la etiqueta (tag) buscada. Con el prefijo @kbd{C-u}, ignora las cabeceras que no son TODO.

source: Create a global list of tag matches from all agenda files. @xref{Matching tags and properties}.
es: Crea una lista global de marcas coincidentes de todos los archivos de la agenda. @xref{Emparejar marcas y propiedades}.

source: Create a global list of tag matches from all agenda files, but check only TODO items and force checking subitems (see variable @code{org-tags-match-list-sublevels}).
es: Crea una lista global de marcas coincidentes de todos los archivos de la agenda, pero chequea solo @'{@dotless{i}}tems TODO y fuerza el chequeo de subitems (ver la variable @code{org-tags-match-list-sublevels}).

source: These commands all prompt for a match string which allows basic Boolean logic like @samp{+boss+urgent-project1}, to find entries with tags @samp{boss} and @samp{urgent}, but not @samp{project1}, or @samp{Kathy|Sally} to find entries which are tagged, like @samp{Kathy} or @samp{Sally}. The full syntax of the search string is rich and allows also matching against TODO keywords, entry levels and properties. For a complete description with many examples, see @ref{Matching tags and properties}.
es: Estos comandos buscan coincidencias de cadenas que permiten una l@'ogica b@'asica como @samp{+jefe+urgente-proyecto1}, para encontrar entradas con marcas @samp{jefe} y @samp{urgente}, pero sin @samp{proyecto1}, o @samp{Jos@'e|Juan} para encontrar ambas entradas, tanto @samp{Jos@'e} como @samp{Juan}. La sint@'axis completa de las cadenas de b@'usqueda es rica y permite adem@'as coincidencias con todas las palabras clave TODO, entradas de nivel y propiedades. Para una completa descripci@'on con muchos ejemplos, vea @ref{Emparejar marcas y propiedades}.

source: @seealso{ @uref{https://orgmode.org/manual/Tags.html#Tags, Chapter 6 of the manual}@* @uref{http://sachachua.com/wp/2008/01/tagging-in-org-plus-bonus-code-for-timeclocks-and-tags/, Sacha Chua's article about tagging in Org-mode}}
es: @seealso{ @uref{https://orgmode.org/manual/Tags.html#Tags, Cap@'{@dotless{i}}tulo 6 del manual}@* @uref{http://sachachua.com/wp/2008/01/tagging-in-org-plus-bonus-code-for-timeclocks-and-tags/, art@'{@dotless{i}}culo de Sacha Chua acerca de etiquetado en Org-mode}}

source: Properties are key-value pairs associated with an entry. They live in a special drawer with the name @code{PROPERTIES}. Each property is specified on a single line, with the key (surrounded by colons) first, and the value after it:
es: Las propiedades son pares clave valor asociados con una entrada. Estos se encuentran en un lugar especial con el nombre @code{PROPERTIES}. Cada propiedad se especifica en una l@'{@dotless{i}}nea simple, con la clave (rodeada por dos puntos) primero, y el valor despu@'es de @'esta.

source: * CD collection ** Classic *** Goldberg Variations :PROPERTIES: :Title: Goldberg Variations :Composer: J.S. Bach :Publisher: Deutsche Grammophon :NDisks: 1 :END:
es: * Colecci@'on de CDs ** Cl@'asica *** Variaciones de Goldberg :PROPERTIES: :T@'{@dotless{i}}tulo: Goldberg Variations :Compositor: J.S. Bach :Discogr@'afica: Deutsche Grammophon :Discos: 1 :END:

source: You may define the allowed values for a particular property @samp{:Xyz:} by setting a property @samp{:Xyz_ALL:}. This special property is @emph{inherited}, so if you set it in a level 1 entry, it will apply to the entire tree. When allowed values are defined, setting the corresponding property becomes easier and is less prone to typing errors. For the example with the CD collection, we can predefine publishers and the number of disks in a box like this:
es: Se pueden definir los valores permitidos para una propiedad particular @samp{:Xyz:} asignando un propiedad @samp{:Xyz_ALL:}. Esta propiedad especial es @emph{heredada}, as@'{@dotless{i}} si se asigna en una entrada de nivel 1, entonces se aplicar@'a al @'arbol entero. Cuando los valores permitidos est@'an definidos, asignar la propiedad correspondiente llega a ser f@'acil y es menos propensa a errores. Para el ejemplo de la colecci@'on de CDs, se pueden predefinir las discogr@'aficas y el n@'umero de discos en una caja como esta:

source: * CD collection :PROPERTIES: :NDisks_ALL: 1 2 3 4 :Publisher_ALL: "Deutsche Grammophon" Philips EMI :END:
es: * Colecci@'on de CDs :PROPERTIES: :Discos_ALL: 1 2 3 4 :Discogr@'afica_ALL: "Deutsche Grammophon" Philips EMI :END:

source: or globally using @code{org-global-properties}, or file-wide like this:
es: o globalmente usando @code{org-global-properties}, o un fichero amplio como este:

source: #+PROPERTY: NDisks_ALL 1 2 3 4
es: #+PROPERTY: Discos_ALL 1 2 3 4

source: Set a property. This prompts for a property name and a value.
es: Asigna una propiedad. Se solicitar@'a un nombre y un valor para la propiedad.

source: Remove a property from the current entry.
es: Elimina una propiedad de la entrada actual.

source: To create sparse trees and special lists with selection based on properties, the same commands are used as for tag searches (@pxref{Tag searches}). The syntax for the search string is described in @ref{Matching tags and properties}.
es: Para crear @'arboles expandidos y listas especiales con selecci@'on basada en propiedades, los mismos comandos son usados para buscar marcas (@pxref{Buscando marcas}). La sintaxis completa para la b@'usqueda de cadenas es descrita en la @ref{Emparejar marcas y propiedades}.

source: @seealso{ @uref{https://orgmode.org/manual/Properties-and-Columns.html#Properties-and-Columns, Chapter 7 of the manual}@* @uref{https://orgmode.org/worg/org-tutorials/org-column-view-tutorial.php,Bastien Guerry's column view tutorial}}
es: @seealso{ @uref{https://orgmode.org/manual/Properties-and-Columns.html#Properties-and-Columns, Cap@'{@dotless{i}}tulo 7 del manual}@* @uref{https://orgmode.org/worg/org-tutorials/org-column-view-tutorial.php,Bastien Guerry's column view tutorial}}

source: To assist project planning, TODO items can be labeled with a date and/or a time. The specially formatted string carrying the date and time information is called a @emph{timestamp} in Org mode.
es: Para tener una planificaci@'on de un proyecto, los @'{@dotless{i}}tems TODO pueden ser etiquetados con una fecha y/o con una hora. La cadena con este formato especial que trae la informaci@'on de fecha y hora es llamado @emph{timestamp} en Org mode.

source: A timestamp is a specification of a date (possibly with a time or a range of times) in a special format, either @samp{<2003-09-16 Tue>} or @samp{<2003-09-16 Tue 09:39>} or @samp{<2003-09-16 Tue 12:00-12:30>}. A timestamp can appear anywhere in the headline or body of an Org tree entry. Its presence causes entries to be shown on specific dates in the agenda (@pxref{Weekly/daily agenda}). We distinguish:
es: Una marca de tiempo (@emph{timestamp}) es una especificaci@'on de una fecha (posiblemente con un tiempo o un rango de tiempos) en un formato especial. Como @samp{<2003-06-16 Jue>} o @samp{<2003-06-16 Jue 09:36>} o @samp{<2003-06-16 Jue 12:00-12:30>}. Una marca de tiempo puede aparecer en cualquier lugar, titular o cuerpo de una entrada del @'arbol Org. Su presencia causa que la entrada sea mostrada en una fecha espec@'{@dotless{i}}fica de la agenda la (@pxref{Agenda semanal/diaria}). Se distingue:

source: @b{Plain timestamp; Event; Appointment}@* A simple timestamp just assigns a date/time to an item. This is just like writing down an appointment or event in a paper agenda.
es: @b{Una marca de tiempo; Evento; Cita}@* Una marca de tiempo simple asigna una fecha/hora a un solo @'{@dotless{i}}tem. Esto es solo como escribir una cita o evento en una agenda en papel.

source: * Meet Peter at the movies <2006-11-01 Wed 19:15> * Discussion on climate change <2006-11-02 Thu 20:00-22:00>
es: * Ver pelis con Pedro <2006-11-01 Wed 19:15> * Discusi@'on acerca del cambio clim@'atico <2006-11-02 Thu 20:00-22:00>

source: @b{Timestamp with repeater interval}@* A timestamp may contain a @emph{repeater interval}, indicating that it applies not only on the given date, but again and again after a certain interval of N days (d), weeks (w), months (m), or years (y). The following will show up in the agenda every Wednesday:
es: @b{Marca de tiempo con intervalo de repetici@'on}@* Una marca de tiempo puede contener un @emph{intervalo de repetici@'on}, indicando que se aplica no solo en la fecha dada, sino que aparece una y otra vez despu@'es de un cierto intervalo de N d@'{@dotless{i}}as (d), semanas @emph{weeks} (w), meses (m), o a@~nos @emph{years} (y). Lo siguiente muestra en la agenda cada Mi@'ercoles:

source: * Pick up Sam at school <2007-05-16 Wed 12:30 +1w>
es: * Recoger a Samuel en el colegio <2007-05-16 Wed 12:30 +1w>

source: @b{Diary-style sexp entries}@* For more complex date specifications, Org mode supports using the special sexp diary entries implemented in the Emacs calendar/diary package. For example
es: @b{Entradas de estilo diario sexp}@* Para especificaciones de fecha m@'as complejas, Org mode da soporte usando las entradas diarias sexp implementadas en el paquete Emacs calendar/diary. Por ejemplo:

source: * The nerd meeting on every 2nd Thursday of the month <%%(diary-float t 4 2)>
es: * El encuentro nerd los segundos jueves del mes <%%(diary-float t 4 2)>

source: @b{Time/Date range}@* Two timestamps connected by @samp{--} denote a range.
es: @b{Rango fecha/hora}@* Dos marcas de tiempo conectadas por @samp{--} denotan un rango.

source: ** Meeting in Amsterdam <2004-08-23 Mon>--<2004-08-26 Thu>
es: ** Encuentro en Amsterdam <2004-08-23 Mon>--<2004-08-26 Thu>

source: @b{Inactive timestamp}@* Just like a plain timestamp, but with square brackets instead of angular ones. These timestamps are inactive in the sense that they do @emph{not} trigger an entry to show up in the agenda.
es: @b{Marcas de tiempo inactivas}@* Como una marca de tiempo @emph{timestamp}, pero con par@'entesis cuadrados en vez de angulares. Estas marcas de tiempo son inactivas en el sentido de que @emph{no} aparecen como entrada en la agenda.

source: * Gillian comes late for the fifth time [2006-11-01 Wed]
es: * Julia lleg@'o tarde por quinta vez [2006-11-01 Wed]

source: For Org mode to recognize timestamps, they need to be in the specific format. All commands listed below produce timestamps in the correct format.
es: Para que Org mode reconozca marcas de tiempo, necesitan estar en el formato espec@'{@dotless{i}}fico. Todos los comandos que se listan debajo producen marcas de tiempo en el formato correcto.

source: Prompt for a date and insert a corresponding timestamp. When the cursor is at an existing timestamp in the buffer, the command is used to modify this timestamp instead of inserting a new one. When this command is used twice in succession, a time range is inserted. With a prefix, also add the current time.
es: Crea un di@'alogo para una fecha e inserta la correspondiente marca de tiempo. Cuando el cursor est@'a en una marca de tiempo existente en el b@'uffer, el comando se usa para modificar esta marca de tiempo en vez de insertar una nueva. Cuando este comando se usa dos veces seguidas, un rango de tiempo se inserta. Hay un prefijo para a@~nadir tambi@'en la hora actual.

source: Like @kbd{C-c .}, but insert an inactive timestamp that will not cause an agenda entry.
es: Como @kbd{C-c .}, pero inserta una marca de tiempo inactiva que no causar@'a una entrada en la agenda.

source: Change date at cursor by one day.
es: Cambia la fecha en el cursor por un d@'{@dotless{i}}a.

source: Change the item under the cursor in a timestamp. The cursor can be on a year, month, day, hour or minute. When the timestamp contains a time range like @samp{15:30-16:30}, modifying the first time will also shift the second, shifting the time block with constant length. To change the length, modify the second time.
es: Cambia el @'{@dotless{i}}tem bajo el cursor en una marca de tiempo. El cursor puede ser en un a@~no, mes, d@'{@dotless{i}}a, hora, o minuto. Cuando la marca de tiempo contiene un rango de tiempo como @samp{15:30-16:30}, modificando la primera vez dividir@'a los segundos, dividiendo el bloque del momento con el tama@~no constante. Para cambiar el tama@~no, modifica una segunda vez.

source: When Org mode prompts for a date/time, it will accept any string containing some date and/or time information, and intelligently interpret the string, deriving defaults for unspecified information from the current date and time. You can also select a date in the pop-up calendar. See the manual for more information on how exactly the date/time prompt works.
es: Cuando Org mode pregunta por una fecha u hora, acepta cualquier cadena conteniendo alguna fecha y/o informaci@'on, e inteligentemente interpretar@'a la cadena, sacando alguna por defecto, para la informaci@'on no especificada desde la actual fecha y hora. Tambi@'en se puede seleccionar una fecha en un calendario pop-up. Ver el manual para m@'as informaci@'on de c@'omo funciona la fecha/hora.

source: A timestamp may be preceded by special keywords to facilitate planning:
es: Una marca de tiempo puede ser precedida por palabras clave especiales para facilitar la planificaci@'on.

source: @b{DEADLINE}@* Meaning: the task (most likely a TODO item, though not necessarily) is supposed to be finished on that date.
es: @b{DEADLINE}@* Significa: la tarea (normalmente un @'{@dotless{i}}tem TODO, aunque no necesariamente) se supone que finalizar@'a en tal fecha.

source: Insert @samp{DEADLINE} keyword along with a stamp, in the line following the headline.
es: Inserta la palabra clave @samp{DEADLINE} con una marca, en la l@'{@dotless{i}}nea siguiente a la cabecera o titular @emph{headline}.

source: On the deadline date, the task will be listed in the agenda. In addition, the agenda for @emph{today} will carry a warning about the approaching or missed deadline, starting @code{org-deadline-warning-days} before the due date, and continuing until the entry is marked DONE. An example:
es: En la fecha de finalizaci@'on @emph{deadline}, la tarea ser@'a listada en la agenda. Adem@'as la agenda para @emph{hoy} traer@'a un aviso acerca de la fecha de finalizaci@'on pasada, empezando @code{org-deadline-warning-days} antes de la fecha y continuando hasta que la entrada es marcada como realizada @emph{DONE}. Un ejemplo:

source: *** TODO write article about the Earth for the Guide The editor in charge is [[bbdb:Ford Prefect]] DEADLINE: <2004-02-29 Sun>
es: *** TODO escribir art@'{@dotless{i}}culo acerca de la Tierra para la Gu@'{@dotless{i}}a. El editor encargado es [[bbdb:Ford Prefect]] DEADLINE: <2004-02-29 Sun>

source: @b{SCHEDULED}@* Meaning: you are @i{planning to start working} on that task on the given date@footnote{This is quite different from what is normally understood by @i{scheduling a meeting}, which is done in Org-mode by just inserting a time stamp without keyword.}.
es: @b{SCHEDULED}@* significa: se @i{planifica empezar trabajando} en esta tarea en la fecha dada@footnote{Esto es bastante diferente, ya que normalmente se comprende la @i{planificaci@'on de un encuentro}, que se hace en Org-mode insertando una marca de tiempo sin palabra clave.}

source: Insert @samp{SCHEDULED} keyword along with a stamp, in the line following the headline.
es: Insertar la palabra clave @samp{SCHEDULED} con una marca, en la l@'{@dotless{i}}nea despu@'es de la cabecera.

source: The headline will be listed under the given date@footnote{It will still be listed on that date after it has been marked DONE. If you don't like this, set the variable @code{org-agenda-skip-scheduled-if-done}.}. In addition, a reminder that the scheduled date has passed will be present in the compilation for @emph{today}, until the entry is marked DONE. I.e.@: the task will automatically be forwarded until completed.
es: La cabecera ser@'a listada bajo la fecha dada@footnote{Todav@'{@dotless{i}}a ser@'a listada en esta fecha despu@'es de que se marque como DONE. Si no gusta esto, se debe establecer la variable @code{org-agenda-skip-scheduled-if-done}.}. Adem@'as, un recordatorio de que la fecha introducida en la agenda que ha pasado estar@'a presente en la compilaci@'on para @emph{hoy}, hasta que la entrada es marcada como DONE. Por ejemplo, la tarea autom@'aticamente ser@'a reenviada hasta ser completada.

source: *** TODO Call Trillian for a date on New Years Eve. SCHEDULED: <2004-12-25 Sat>
es: *** TODO Llamar a Trillian para una cita en A@~no Nuevo. SCHEDULED: <2004-12-25 Sat>

source: Some tasks need to be repeated again and again. Org mode helps to organize such tasks using a so-called repeater in a DEADLINE, SCHEDULED, or plain timestamp. In the following example
es: Algunas tareas necesitan ser repetidas de nuevo y de nuevo. Org mode ayuda a organizar tales tareas usando un repetidor en una fecha l@'{@dotless{i}}mite @emph{DEADLINE}, @emph{SCHEDULED}, o una marca de tiempo en texto plano. En el siguiente ejemplo

source: ** TODO Pay the rent DEADLINE: <2005-10-01 Sat +1m>
es: ** TODO Pagar el alquiler DEADLINE: <2005-10-01 Sat +1m>

source: the @code{+1m} is a repeater; the intended interpretation is that the task has a deadline on <2005-10-01> and repeats itself every (one) month starting from that time.
es: el @code{+1m} es un repetidor; la interpretaci@'on que se pretende es que la tarea tiene una fecha l@'{@dotless{i}}mite en <2005-10-01> y repite por s@'{@dotless{i}} mismo cada mes empezando desde este momento.
