Repository: bzg/worg
Catalog: orgguide/orgguide.*.po
Languages: es

source: The @code{:results} header argument controls the @emph{collection}, @emph{type}, and @emph{handling} of code block results. Values of @code{output} or @code{value} (the default) specify how results are collected from a code block's evaluation. Values of @code{vector}, @code{scalar} @code{file} @code{raw} @code{html} @code{latex} and @code{code} specify the type of the results of the code block which dictates how they will be incorporated into the Org-mode buffer. Values of @code{silent}, @code{replace}, @code{prepend}, and @code{append} specify handling of code block results, specifically if and how the results should be inserted into the Org-mode buffer.
es: El argumento de cabecera @code{:results} controla el @emph{collection}, @emph{type}, y @emph{handling} de resultados de bloques de c@'odigo. Valores de @code{output} o @code{value} (por defecto) especifican como los resultados son recogidos desde la evaluaci@'on de bloques de c@'odigo. Valores de @code{vector}, @code{scalar}, @code{file}, @code{raw}, @code{html}, @code{latex} and @code{code} especifican el tipo de resultados del bloque c@'odigo que dicta c@'omo ser@'an incorporados dentro del buffer Org-mode. Valores de @code{silent}, @code{replace}, @code{prepend}, y @code{append} especifica el manejo de resultados de bloques de c@'odigo, espec@'{@dotless{i}}ficamente si y c@'omo los resultados deber@'{@dotless{i}}an ser insertados dentro del b@'uffer Org-mode.

source: A header argument of @code{:session} will cause the code block to be evaluated in a persistent interactive inferior process in Emacs. This allows for persisting state between code block evaluations, and for manual inspection of the results of evaluation.
es: Un argumento de cabecera de @code{:session} causar@'a el bloque de c@'odigo para ser evaluada en un proceso inferior persistente en Emacs. Esto permite el estado persistente entre evaluaciones de bloque de c@'odigo, y para inspecci@'on de manual de los resultados de evaluaci@'on.

source: :exports
es: :exporta

source: Any combination of the @emph{code} or the @emph{results} of a block can be retained on export, this is specified by setting the @code{:results} header argument to @code{code} @code{results} @code{none} or @code{both}.
es: Cualquier combinaci@'on del @emph{code} @'o los @emph{resultados} de un bloque puede ser retenido en exportar, esto est@'a espec@'{@dotless{i}}ficado por configuraci@'on de los @code{:results} de argumentos de cabecera para @code{c@'odigo} @code{resultados} @code{ninguno} @'o @code{ambos}.

source: A header argument of @code{:tangle yes} will cause a code block's contents to be tangled to a file named after the filename of the Org-mode buffer. An alternate file name can be specified with @code{:tangle filename}.
es: Un argumento de cabecera de @code{:tangle yes} causar@'a de bloques de c@'odigo se enreda a un fichero llamado despu@'es del nombre del fichero del b@'uffer Org-mode. Un nombre de fichero alternativo puede ser especificado con @code{:tangle filename}.

source: A header argument of @code{:cache yes} will cause associate a hash of the expanded code block with the results, ensuring that code blocks are only re-run when their inputs have changed.
es: Un argumento de cabecera de @code{:cache yes} causar@'a asociar un hash del bloque c@'odigo expandido con los resultados, asegurando que los bloques de c@'odigo est@'an solo rearrancados con sus entradas han cambiado.

source: A header argument of @code{:noweb yes} will expand ``noweb'' style references on evaluation and tangling.
es: Un argumento de cabecera de @code{:noweb yes} expandir@'a ``noweb'' referencias de estilo en evaluaci@'on y enredo.

source: Code blocks which output results to files (e.g.@: graphs, diagrams and figures) can accept a @code{:file filename} header argument in which case the results are saved to the named file, and a link to the file is inserted into the Org-mode buffer.
es: Los bloques de c@'odigo cuya salida resulta a ficheros (por ej.@: grafos, diagramas y figuras) puede aceptar un @code{:file nombre de fichero} argumento de cabecera en cuyo caso los resultados est@'an a salvo para el fichero nombrado, y un enlace al fichero se insertan dentro del b@'uffer Org-mode.

source: @seealso{ @uref{https://orgmode.org/manual/Literal-examples.html#Literal-examples, Chapter 11.3 of the manual}@* @uref{https://orgmode.org/worg/org-contrib/babel/index.php, The Babel site on Worg}}
es: @seealso{ @uref{https://orgmode.org/manual/Literal-examples.html#Literal-examples, Cap@'{@dotless{i}}tulo 11.3 del manual}@* @uref{https://orgmode.org/worg/org-contrib/babel/index.php, El sitio Babel en Worg}}

source: Org supports in-buffer completion with @kbd{M-@key{TAB}}. This type of completion does not make use of the minibuffer. You simply type a few letters into the buffer and use the key to complete text right there. For example, this command will complete @TeX{} symbols after @samp{\}, TODO keywords at the beginning of a headline, and tags after @samp{:} in a headline.
es: Org soporta autocompleci@'on en b@'uffer con @kbd{M-@key{TAB}}. Este tipo de autocompletado no hace uso del minib@'uffer. Simplemente escribe unas pocas letras dentro del b@'uffer y usa la clave para completar texto correctamente. Por ejemplo, este comando completar@'a s@'{@dotless{i}}mbolos @TeX{} despu@'es @samp{\}, palabras clave TODO al principio de la l@'{@dotless{i}}nea de cabeza, y etiquetas despu@'es de @samp{:} en una l@'{@dotless{i}}nea de cabeza.

source: A cleaner outline view
es: Una vista del contorno de limpieza

source: Some people find it noisy and distracting that the Org headlines start with a potentially large number of stars, and that text below the headlines is not indented. While this is no problem when writing a @emph{book-like} document where the outline headings are really section headings, in a more @emph{list-oriented} outline, indented structure is a lot cleaner:
es: Algunas personas encuentran ruidoso y distraido que las cabeceras Org empiecen con un n@'umero potencialmente largo de estrellas, y que el texto de debajo de las l@'{@dotless{i}}neas de cabecera no est@'an indentadas. Mientras esto no es problema cuando se escribe un documento @emph{tipo libro} donde el contorno de cabeceras son realmente cabeceras de secci@'on, en una idea general @emph{orientada a listas}, la estructura indentada es muy limpia:

source: * Top level headline | * Top level headline ** Second level | * Second level *** 3rd level | * 3rd level some text | some text *** 3rd level | * 3rd level more text | more text * Another top level headline | * Another top level headline
es: * Cabecera de alto nivel | * Cabecera de alto nivel ** Segundo nivel | * Segundo nivel *** Tercer nivel | * Tercer nivel alg@'un texto | alg@'un texto *** Tercer nivel | * Tercer nivel m@'as texto | m@'as texto * Otra cabecera de alto nivel | * Otra cabecera de alto nivel

source: If you are using at least Emacs 23.1.50.3 and version 6.29 of Org, this kind of view can be achieved dynamically at display time using @code{org-indent-mode}, which will prepend intangible space to each line. You can turn on @code{org-indent-mode} for all files by customizing the variable @code{org-startup-indented}, or you can turn it on for individual files using
es: Si se est@'a usando al menos Emacs 23.1.50.3 y la versi@'on 6.29 de Org, este tipo de vista puede ser lograda din@'amicamente

source: #+STARTUP: indent
es: #+STARTUP: indentar

source: If you want a similar effect in earlier version of Emacs and/or Org, or if you want the indentation to be hard space characters so that the plain text file looks as similar as possible to the Emacs display, Org supports you by helping to indent (with @key{TAB}) text below each headline, by hiding leading stars, and by only using levels 1, 3, etc to get two characters indentation for each level. To get this support in a file, use
es: Si se quiere un efecto similar en una versi@'on temprana de Emacs y/o Org, o si se quiere la indentaci@'on para endurecer caracteres de espacio, as@'{@dotless{i}} que el texto plano del fichero se vea tan similar como sea posible para la visualizaci@'on de Emacs, Org soporta ayudar para indentar texto (con @key{TAB}) debajo de cada cabecera, ocultando estrellas destacadas, y solo usando niveles 1, 3, etc. para obtener dos caracteres de indentaci@'on para cada nivel. Para tener este soporte en un fichero, use:

source: #+STARTUP: hidestars odd
es: #+STARTUP: oculta estrellas impares

source: @i{MobileOrg} is the name of the mobile companion app for Org mode, currently available for iOS and for Android. @i{MobileOrg} offers offline viewing and capture support for an Org mode system rooted on a ``real'' computer. It does also allow you to record changes to existing entries.
es: @i{MobileOrg} es el nombre de la compa@~n@'{@dotless{i}}a de m@'oviles para Org mode actualmente disponible para iOS y para Android. @i{MobileOrg} ofrece una vista offline y soporta captura para un sistema Org mode ruteado en un ordenador ``real''. Esto permite grabar cambios a entradas existentes.

source: The @uref{http://mobileorg.ncogni.to/, iOS implementation} for the @i{iPhone/iPod Touch/iPad} series of devices, was developed by Richard Moreland. Android users should check out @uref{http://wiki.github.com/matburt/mobileorg-android/, MobileOrg Android} by Matt Jones. The two implementations are not identical but offer similar features.
es: La @uref{http://mobileorg.ncogni.to/, implementaci@'on iOS} para la serie de dispositivos @i{iPhone/iPod Touch/iPad}, fu@'e por Richard Moreland. Los usuarios de Android deber@'{@dotless{i}}an descargar @uref{http://wiki.github.com/matburt/mobileorg-android/, MobileOrg Android} hecho por Matt Jones. Las dos implementaciones no son id@'enticas pero ofrecen funcionalidades similares.

source: @seealso{ @uref{https://orgmode.org/manual/Miscellaneous.html#Miscellaneous, Chapter 15 of the manual}@* @uref{https://orgmode.org/manual/MobileOrg.html#MobileOrg, Appendix B of the manual}@* @uref{https://orgmode.org/orgcard.pdf,Key reference card}}
es: @seealso{ @uref{https://orgmode.org/manual/Miscellaneous.html#Miscellaneous, Cap@'{@dotless{i}}tulo 15 del manual}@* @uref{https://orgmode.org/manual/MobileOrg.html#MobileOrg, Ap@'endice B del manual}@* @uref{https://orgmode.org/orgcard.pdf,tarjeta de referencia}}
