Repository: bzg/worg
Catalog: orgguide/orgguide.*.po
Languages: es

source: In a new entry with no text yet, @key{TAB} will cycle through reasonable levels.
es: En una nueva entrada sin texto a@'un, @key{TAB} rotar@'a c@'{@dotless{i}}clicamente a trav@'es de niveles similares.

source: Promote/demote current heading by one level.
es: Promociona/deval@'ua la cabecera actual en un nivel.

source: Promote/demote the current subtree by one level.
es: Promociona/deval@'ua el sub@'arbol actual en un nivel.

source: Move subtree up/down (swap with previous/next subtree of same level).
es: Mueve el sub@'arbol arriba/abajo (intercambia entre anterior/siguiente sub@'arbol del mismo nivel).

source: Refile entry or region to a different location. @xref{Refile and copy}.
es: Mueve la entrada o regi@'on en una lozalizaci@'on diferente. @xref{Rellenar y copiar}.

source: Narrow buffer to current subtree / widen it again
es: Limitar la memoria intermedia al @'arbol actual / ocult@'andolo

source: When there is an active region (Transient Mark mode), promotion and demotion work on all headlines in the region.
es: Cuando se trata de una regi@'on activa (Transient Mark mode), promueve y deval@'ua las cabeceras de la regi@'on.

source: An important feature of Org mode is the ability to construct @emph{sparse trees} for selected information in an outline tree, so that the entire document is folded as much as possible, but the selected information is made visible along with the headline structure above it@footnote{See also the variables @code{org-show-hierarchy-above}, @code{org-show-following-heading}, @code{org-show-siblings}, and @code{org-show-entry-below} for detailed control on how much context is shown around each match.}. Just try it out and you will see immediately how it works.
es: Una caracter@'{@dotless{i}}stica importante de Org-mode es su posibilidad para construir @emph{@'arboles poco densos} para la informaci@'on seleccionada en un @'arbol de outlines, as@'{@dotless{i}} se maneja el documento entero, pero la informaci@'on seleccionada se hace visible con la estructura de cabeceras de encima@footnote{V@'ease adem@'as las variables @code{org-show-hierarchy-above}, @code{org-show-following-heading}, @code{org-show-siblings} y @code{org-show-entry-below} para controlar los detalles de c@'omo el contexto se muestra en cada coincidencia.}. Int@'entelo ahora y ver@'a inmediatamente como funciona.

source: Org mode contains several commands creating such trees, all these commands can be accessed through a dispatcher:
es: Org-mode contiene varios comandos para crear @'arboles, todos estos comandos pueden ser accedidos a trav@'es del disparador:

source: This prompts for an extra key to select a sparse-tree creating command.
es: Esto muestra una consola para introducir una clave especial para seleccionar un comando de creaci@'on de un @'arbol poco denso.

source: Occur. Prompts for a regexp and shows a sparse tree with all matches. Each match is also highlighted; the highlights disappear by pressing @kbd{C-c C-c}.
es: Se refiere a que aparezca un patr@'on. La consola ofrece introducir una expresi@'on regular y muestra un @'arbol poco denso con todas sus coincidencias. Cada coincidencia se ilumina; La iluminaci@'on desaparece presionando @kbd{C-c C-c}.

source: The other sparse tree commands select headings based on TODO keywords, tags, or properties and will be discussed later in this manual.
es: Otros comandos de @'arbol poco denso seleccionan las cabeceras basadas en la palabra reservada TODO, etiquetas o propiedades y ser@'an discutidos posteriormente en este manual.

source: Within an entry of the outline tree, hand-formatted lists can provide additional structure. They also provide a way to create lists of checkboxes (@pxref{Checkboxes}). Org supports editing such lists, and the HTML exporter (@pxref{Exporting}) parses and formats them.
es: Sin una entrada en el @'arbol de outlines, las listas formateadas a mano pueden suministrar una estructura adicional. Ello tambi@'en proporciona una forma de crear listas de cajas de chequeo (@pxref{Cajas de chequeo}). Org soporta la edici@'on de tales listas, y el conversor HTML (@pxref{Exportando}) los analiza y formatea.

source: Org knows ordered lists, unordered lists, and description lists.
es: Org permite listas ordenadas, listas desordenadas y listas de descripci@'on.

source: @emph{Unordered} list items start with @samp{-}, @samp{+}, or @samp{*} as bullets.
es: @emph{Desordenada} los @'{@dotless{i}}tems de la lista comienzan con @samp{-}, @samp{+} o @samp{*} como marcas.

source: @emph{Ordered} list items start with @samp{1.} or @samp{1)}.
es: @emph{Ordenada} los @'{@dotless{i}}tems de la lista comienzan con @samp{1.} o @samp{1)}.

source: @emph{Description} list use @samp{ :: } to separate the @emph{term} from the description.
es: @emph{Descripci@'on} la lista usa @samp{ :: } para separar el @emph{t@'ermino} de la descripci@'on.

source: Items belonging to the same list must have the same indentation on the first line. An item ends before the next line that is indented like its bullet/number, or less. A list ends when all items are closed, or before two blank lines. An example:
es: Los @'{@dotless{i}}tems subsiguientes de la misma lista deben tener el mismo sangrado en la primera l@'{@dotless{i}}nea. Un @'{@dotless{i}}tem que termine antes de la siguiente l@'{@dotless{i}}nea ser@'a sangrado como bola/n@'umero, o no. Una lista termina cuando todos los @'{@dotless{i}}tems est@'an cerrados, o antes de dos l@'{@dotless{i}}neas en blanco. Un ejemplo:

source: ** Lord of the Rings My favorite scenes are (in this order) 1. The attack of the Rohirrim 2. Eowyn's fight with the witch king + this was already my favorite scene in the book + I really like Miranda Otto. Important actors in this film are: - @b{Elijah Wood} :: He plays Frodo - @b{Sean Austin} :: He plays Sam, Frodo's friend.
es: ** El Se@~nor de los Anillos Mis escenas favoritas son (en este orden) 1. El ataque de Rohirrim 2. Combate de Eowyn con el rey + Esta es tambi@'en mi escena favorita en el libro + Es realmente como Miranda Otto. Actores importantes es esta pel@'{@dotless{i}}cula: - @b{Elijah Wood} :: En el papel de Frodo - @b{Sean Austin} :: En el papel de Sam, amigo de Frodo.

source: The following commands act on items when the cursor is in the first line of an item (the line with the bullet or number).
es: Los siguientes comandos act@'uan en @'{@dotless{i}}tems cuando el cursor est@'a en la primera l@'{@dotless{i}}nea de un @'{@dotless{i}}tem (la l@'{@dotless{i}}nea con la bola o el n@'umero).

source: Items can be folded just like headline levels.
es: Los @'{@dotless{i}}tems pueden manejarse como cabeceras en diferentes niveles jer@'arquicos.

source: Insert new item at current level. With a prefix argument, force a new heading (@pxref{Structure editing}).
es: Inserta un nuevo @'{@dotless{i}}tem al nivel actual. Con el argumento de prefijo, se fuerza a una nueva cabecera (@pxref{Edici@'on de estructura}).

source: Insert a new item with a checkbox (@pxref{Checkboxes}).
es: Inserta un nuevo @'{@dotless{i}}tem con una caja de chequeo (@pxref{Cajas de chequeo}).

source: Move the item including subitems up/down (swap with previous/next item of same indentation). If the list is ordered, renumbering is automatic.
es: Mueve el @'{@dotless{i}}tem incluyendo los sub@'{@dotless{i}}tems arriba/abajo (intercambia con el @'{@dotless{i}}tem previo/siguiente del mismo sangrado. Si la lista es ordenada, volver a numerar es autom@'atico.

source: Decrease/increase the indentation of an item, leaving children alone.
es: Decrementa/incrementa el sangrado del @'{@dotless{i}}tem, dejando los hijos sueltos.

source: Decrease/increase the indentation of the item, including subitems.
es: Decrementa/incrementa el sangrado del @'{@dotless{i}}tem, incluyendo los sub@'{@dotless{i}}tems.

source: If there is a checkbox (@pxref{Checkboxes}) in the item line, toggle the state of the checkbox. Also verify bullets and indentation consistency in the whole list.
es: Si es una caja de chequeo (@pxref{Cajas de chequeo}) en una l@'{@dotless{i}}nea @'{@dotless{i}}tem, cambia el estado de la caja de chequeo. Adem@'as verifica las bolas y el sangrado consiste en la lista completa.

source: Cycle the entire list level through the different itemize/enumerate bullets (@samp{-}, @samp{+}, @samp{*}, @samp{1.}, @samp{1)}).
es: Rota la lista entera a trav@'es de diferentes bolas de numeraci@'on/marcado (@samp{-}, @samp{+}, @samp{*}, @samp{1.}, @samp{1)}).

source: A footnote is defined in a paragraph that is started by a footnote marker in square brackets in column 0, no indentation allowed. The footnote reference is simply the marker in square brackets, inside text. For example:
es: Una Nota al pie se define como un p@'arrafo que comienza con una nota al pie marcada entre corchetes en la columna 0, sin ning@'un sangrado. La referencia a la nota al pie es simplemente una marca hecha con corchetes, texto incluido. Por ejemplo:

source: The Org homepage[fn:1] now looks a lot better than it used to. ... [fn:1] The link is: https://orgmode.org
es: La p@'agina web de Org[fn:1] ahora parece un poco mejor que cuando la usaba. ... [fn:1] El enlace es: https://orgmode.org

source: The following commands handle footnotes:
es: El siguiente comando maneja notas al pi@'e:

source: The footnote action command. When the cursor is on a footnote reference, jump to the definition. When it is at a definition, jump to the (first) reference. Otherwise, create a new footnote. When this command is called with a prefix argument, a menu of additional options including renumbering is offered.
es: El comando de acci@'on de Nota al pie. Cuando el cursor est@'a en una referencia a una nota al pie, salta a su definici@'on. Cuando est@'a en la definici@'on, salta a la (primera) referencia. En otro caso, crea una nueva nota al pie. Cuando este comando se llama con un argumento prefijo, aparecer@'a un men@'u adicional incluyendo opciones de volver a numerar.

source: Jump between definition and reference.
es: Salta entre definici@'on y referencia.

source: @seealso{ @uref{https://orgmode.org/manual/Document-Structure.html#Document-Structure, Chapter 2 of the manual}@* @uref{http://sachachua.com/wp/2008/01/outlining-your-notes-with-org/, Sacha Chua's tutorial}}
es: @seealso{@uref{https://orgmode.org/manual/Document-Structure.html#Document-Structure, Cap@'{@dotless{i}}tulo 2 del manual de Org-mode}@*@uref{http://sachachua.com/wp/2008/01/outlining-your-notes-with-org/, Tutorial de Sacha Chua}}

source: Org comes with a fast and intuitive table editor. Spreadsheet-like calculations are supported in connection with the Emacs @file{calc} package
es: Org viene con un r@'apido e intuitivo editor de tablas. C@'alculos similares a los de una hoja de c@'alculo son soportados en conexi@'on con el paquete Emacs @file{calc}

source: (see the Emacs Calculator manual for more information about the Emacs calculator).
es: (vea el manual de Emacs Calculator para m@'as informaci@'on sobre la calculadora de Emacs).

source: Org makes it easy to format tables in plain ASCII. Any line with @samp{|} as the first non-whitespace character is considered part of a table. @samp{|} is also the column separator. A table might look like this:
es: Org hace f@'acil formatear tablas en ASCII plano. Cualquier l@'{@dotless{i}}nea con @samp{|} como primer car@'acter no-espacio es considerado parte de una tabla. @samp{|} es adem@'as el separador de columnas. Una tabla puede parecer algo as@'{@dotless{i}}:

source: | Name | Phone | Age | |-------+-------+-----| | Peter | 1234 | 17 | | Anna | 4321 | 25 |
es: | Nombre | Tel@'efono | Edad | |---------+----------+------| | Pedro | 12345678 | 17 | | Ana | 87654321 | 25 |

source: A table is re-aligned automatically each time you press @key{TAB} or @key{RET} or @kbd{C-c C-c} inside the table. @key{TAB} also moves to the next field (@key{RET} to the next row) and creates new table rows at the end of the table or before horizontal lines. The indentation of the table is set by the first line. Any line starting with @samp{|-} is considered as a horizontal separator line and will be expanded on the next re-align to span the whole table width. So, to create the above table, you would only type
es: Una tabla se realinea autom@'aticamente cada vez que se presiona @key{TAB} o @key{RET} o @kbd{C-c C-c} dentro de la tabla. @key{TAB} adem@'as mueve al siguiente campo (@key{RET} a la siguiente fila) y crea una nueva tabla de filas al final de la tabla o antes de las l@'{@dotless{i}}neas horizontales. El sangrado de la tabla se pone en la primera l@'{@dotless{i}}nea. Cualquier l@'{@dotless{i}}nea comenzando con @samp{|-} se considera como un separador horizontal de l@'{@dotless{i}}nea y ser@'a expandido en la siguiente realineaci@'on para expandirse al ancho completo de la tabla. As@'{@dotless{i}}, para crear una tabla dentro, debe s@'olo introducirse:

source: |Name|Phone|Age| |-
es: |Nombre|Tel@'efono|Edad| |-

source: and then press @key{TAB} to align the table and start filling in fields. Even faster would be to type @code{|Name|Phone|Age} followed by @kbd{C-c @key{RET}}.
es: y entonces presionar @key{TAB} para alinear la tabla y empieza rellenando campos. Incluso m@'as r@'apido ser@'{@dotless{i}}a escribir @code{|Nombre|Tel@'efono|Edad} seguido de @kbd{C-c @key{RET}}.

source: When typing text into a field, Org treats @key{DEL}, @key{Backspace}, and all character keys in a special way, so that inserting and deleting avoids shifting other fields. Also, when typing @emph{immediately after the cursor was moved into a new field with @kbd{@key{TAB}}, @kbd{S-@key{TAB}} or @kbd{@key{RET}}}, the field is automatically made blank.
es: Cuando se introduce texto en un campo, Org trata @key{DEL}, @key{Backspace} y todas las teclas de forma especial, para que la inserci@'on y el borrado eviten desplazarse a otros campos. Por tanto, cuando se introduce @emph{inmediatamente despu@'es de que el cursor se haya movido dentro de un nuevo campo con @kbd{@key{TAB}}, @kbd{S-@key{TAB}} o @kbd{@key{RET}}}, el campo es autom@'aticamente puesto en blanco.

source: @tsubheading{Creation and conversion}
es: @tsubheading{Creaci@'on y conversi@'on}

source: Convert the active region to table. If every line contains at least one TAB character, the function assumes that the material is tab separated. If every line contains a comma, comma-separated values (CSV) are assumed. If not, lines are split at whitespace into fields. @* If there is no active region, this command creates an empty Org table. But it's easier just to start typing, like @kbd{|Name|Phone|Age C-c @key{RET}}.
es: Convierte la regi@'on activa en tabla. Si cada l@'{@dotless{i}}nea contiene al menos un car@'acter TAB, la funci@'on asume que la informaci@'on est@'a separada por tabuladores. Si cada l@'{@dotless{i}}nea contiene una coma, se asumen valores separados por coma (CSV). Si no, las l@'{@dotless{i}}neas son partidas en campos por los espacios. @* Si no hay regi@'on activa, este comando crea una tabla Org vacia. Pero es f@'acil justo ahora comenzar a introducir algo como @kbd{|Nombre|Tel@'efono|Edad C-c @key{RET}}.

source: @tsubheading{Re-aligning and field motion}
es: @tsubheading{Realineaci@'on y movimiento}

source: Re-align the table without moving the cursor.
es: Realinea la tabla sin mover el cursor.

source: Re-align the table, move to the next field. Creates a new row if necessary.
es: Realinea la tabla, se mueve al siguiente campo. Crea una nueva fila si es necesario.

source: Re-align, move to previous field.
es: Realinea, moverse al campo anterior.

source: Re-align the table and move down to next row. Creates a new row if necessary.
es: Realinea la tabla y se mueve abajo a la siguiente fila. Crea una nueva fila si es necesario.

source: @tsubheading{Column and row editing}
es: @tsubheading{Edici@'on de filas y columnas}

source: Move the current column left/right.
es: Mueve el cursor a la columna izquierda/derecha.

source: Kill the current column.
es: Elimina la columna actual.

source: Insert a new column to the left of the cursor position.
es: Inserta una nueva columna a la izquierda de la posici@'on del cursor.

source: Move the current row up/down.
es: Mueve la actual fila arriba/abajo.

source: Kill the current row or horizontal line.
es: Elimina la fila o l@'{@dotless{i}}nea horizontal actual.

source: Insert a new row above the current row. With a prefix argument, the line is created below the current one.
es: Inserta una nueva fila sobre la fila actual. Con prefijo argumento, la l@'{@dotless{i}}nea se crea debajo de la actual.

source: Insert a horizontal line below current row. With a prefix argument, the line is created above the current line.
es: Inserta una l@'{@dotless{i}}nea horizontal bajo la fila actual. Con prefijo argumento, la l@'{@dotless{i}}nea se crea sobre la l@'{@dotless{i}}nea actual.

source: Insert a horizontal line below current row, and move the cursor into the row below that line.
es: Inserta una l@'{@dotless{i}}nea horizontal bajo la fila actual, y mueve el cursor a la fila bajo la l@'{@dotless{i}}nea.

source: Sort the table lines in the region. The position of point indicates the column to be used for sorting, and the range of lines is the range between the nearest horizontal separator lines, or the entire table.
es: Ordena las l@'{@dotless{i}}neas de una tabla en una regi@'on. La posici@'on del punto indica la columna usada para la ordenaci@'on, y el rango de l@'{@dotless{i}}neas es el rango entre el separador de l@'{@dotless{i}}neas m@'as pr@'oximo, o la tabla completa.

source: @seealso{ @uref{https://orgmode.org/manual/Tables.html#Tables, Chapter 3 of the manual}@* @uref{https://orgmode.org/worg/org-tutorials/tables.php, Bastien's table tutorial}@* @uref{https://orgmode.org/worg/org-tutorials/org-spreadsheet-intro.php, Bastien's spreadsheet tutorial}@* @uref{http://orgmode.org/worg/org-tutorials/org-plot.php, Eric's plotting tutorial}}
es: @seealso{ @uref{https://orgmode.org/manual/Tables.html#Tables, Cap@'{@dotless{i}}tulo 3 del manual de Org }@* @uref{https://orgmode.org/worg/org-tutorials/tables.php, Tutorial de tablas de Bastien}@* @uref{https://orgmode.org/worg/org-tutorials/org-spreadsheet-intro.php, Tutorial de hojas de c@'alculo de Bastien}@* @uref{https://orgmode.org/worg/org-tutorials/org-plot.php, Tutorial de gr@'aficos de Eric}}

source: Like HTML, Org provides links inside a file, external links to other files, Usenet articles, emails, and much more.
es: Al igual que HTML, Org permite enlaces dentro de archivos, enlaces externos a otros archivos, art@'{@dotless{i}}culos de Usenet, correos electr@'onicos y mucho m@'as.

source: Org will recognize plain URL-like links and activate them as clickable links. The general link format, however, looks like this:
es: Org reconocer@'a enlaces de texto tipo URL y los activar@'a como enlaces en los que se puede hacer click. El formato de enlace general, sin embargo, se ve de la siguiente manera:

source: [[link][description]] @r{or alternatively} [[link]]
es: [[enlace][descripcion]] @r{o de manera alternativa} [[enlace]]

source: Once a link in the buffer is complete (all brackets present), Org will change the display so that @samp{description} is displayed instead of @samp{[[link][description]]} and @samp{link} is displayed instead of @samp{[[link]]}. To edit the invisible @samp{link} part, use @kbd{C-c C-l} with the cursor on the link.
es: Una vez que un enlace en el b@'uffer est@'a completo (con todos los corchetes presentes), Org cambiar@'a la vista de tal manera que la @samp{descripci@'on} se mostrar@'a en vez de @samp{[[enlace][descripci@'on]]} y @samp{enlace} ser@'a mostrado en vez de @samp{[[enlace]]}. Para editar la parte invisible de @samp{enlace}, use @kbd{C-c C-l} con el cursor en el enlace.

source: If the link does not look like a URL, it is considered to be internal in the current file. The most important case is a link like @samp{[[#my-custom-id]]} which will link to the entry with the @code{CUSTOM_ID} property @samp{my-custom-id}.
es: Si el enlace no parece una URL, puede ser debido a que es un enlace interno en el fichero actual. El caso m@'as importante es un enlace como @samp{[[#mi-id-personal]]} que enlazar@'a a la entrada con la propiedad @code{CUSTOM_ID} como @samp{[[#mi-id-personal]]}.

source: Links such as @samp{[[My Target]]} or @samp{[[My Target][Find my target]]} lead to a text search in the current file for the corresponding target which looks like @samp{<<My Target>>}.
es: Enlaces tales como @samp{[[Mi Objetivo]]} o @samp{[[Mi Objetivo][Encuentra mi objetivo]]} conduce a una b@'usqueda de texto en el fichero actual para el correspondiente objetivo se parezca a @samp{<<Mi objetivo>>}

source: Internal links will be used to reference their destination, through links or numbers, when possible.
es: Los enlaces internos ser@'an usados para referenciar su destino, a trav@'es de enlaces o n@'umeros, cuando sea posible.

source: Org supports links to files, websites, Usenet and email messages, BBDB database entries and links to both IRC conversations and their logs. External links are URL-like locators. They start with a short identifying string followed by a colon. There can be no space after the colon. Here are some examples:
es: Org tiene soporte para enlaces a ficheros, sitios web, mensajes de correo electr@'onico y de News, entradas de bases de datos BBDB y enlaces a conversaciones de IRC y sus logs. Enlaces externos son identificadores tipo URL. Estos empiezan con una breve cadena de identificaci@'on seguida por dos puntos. Sin espacio despu@'es de los dos puntos. Aqu@'{@dotless{i}} se presentan algunos ejemplos:

source: http://www.astro.uva.nl/~dominik @r{on the web} file:/home/dominik/images/jupiter.jpg @r{file, absolute path} /home/dominik/images/jupiter.jpg @r{same as above} file:papers/last.pdf @r{file, relative path} file:projects.org @r{another Org file} docview:papers/last.pdf::NNN @r{open file in doc-view mode at page NNN} id:B7423F4D-2E8A-471B-8810-C40F074717E9 @r{Link to heading by ID} news:comp.emacs @r{Usenet link} mailto:adent@@galaxy.net @r{Mail link} vm:folder @r{VM folder link} vm:folder#id @r{VM message link} wl:folder#id @r{WANDERLUST message link} mhe:folder#id @r{MH-E message link} rmail:folder#id @r{RMAIL message link} gnus:group#id @r{Gnus article link} bbdb:R.*Stallman @r{BBDB link (with regexp)} irc:/irc.com/#emacs/bob @r{IRC link} info:org:External%20links @r{Info node link (with encoded space)}
es: http://www.astro.uva.nl/~dominik @r{en la web} file:/home/dominik/images/jupiter.jpg @r{fichero, ruta absoluta} /home/dominik/images/jupiter.jpg @r{lo mismo que arriba} file:papers/last.pdf @r{fichero, ruta relativa} file:projects.org @r{otro fichero org} docview:papers/last.pdf::NNN @r{fichero abierto en modo doc-view en la p@'agina NNN} id:B7423F4D-2E8A-471B-8810-C40F074717E9 @r{enlace a un identificador} news:comp.emacs @r{enlace a un grupo de news} mailto:adent@@galaxy.net @r{enlace de Correo} vm:folder @r{enlace a una carpeta de VM} vm:folder#id @r{enlace a un mensaje de VM} wl:folder#id @r{enlace a un mensaje de WANDERLUST} mhe:folder#id @r{enlace a un mensaje de MH-E} rmail:folder#id @r{enlace a un mensaje de RMAIL} gnus:group#id @r{enlace a un mensaje de GNUS} bbdb:R.*Stallman @r{enlace a una entrada de BBDB (con expresi@'on regular)} irc:/irc.com/#emacs/bob @r{enlace de IRC} info:org:External%20links @r{enlace a un nodo Info (con el espacio en blanco codificado)}

source: A link should be enclosed in double brackets and may contain a descriptive text to be displayed instead of the URL (@pxref{Link format}), for example:
es: Un enlace debe ser encerrado entre corchetes y puede tener un texto descriptivo que ser@'a mostrado en vez de la URL (@pxref{Formato de enlace}), por ejemplo:
