Repository: bzg/worg
Catalog: orgguide/orgguide.*.po
Languages: es

source: If the description is a file name or URL that points to an image, HTML export (@pxref{HTML export}) will inline the image as a clickable button. If there is no description at all and the link points to an image, that image will be inlined into the exported HTML file.
es: Si la descripci@'on es un nombre de fichero o URL que apunta a una imagen, la exportaci@'on HTML (@pxref{HTML export}) introducir@'a la imagen como un bot@'on al que se puede hacer click. Si no hay descripci@'on y el enlace apunta a una imagen, esta imagen se incrustar@'a dentro del fichero HTML exportado.

source: Org provides methods to create a link in the correct syntax, to insert it into an Org file, and to follow the link.
es: Org provee m@'etodos para crear un enlace con la sintaxis correcta, para insertarlo en un fichero Org, y poder seguir el enlace.

source: Store a link to the current location. This is a @emph{global} command (you must create the key binding yourself) which can be used in any buffer to create a link. The link will be stored for later insertion into an Org buffer (see below).
es: Almacena un enlace desde la posici@'on actual. @'Este es un comando @emph{global} (se debe crear el atajo de teclado por uno mismo), el cual puede ser usado en cualquier b@'uffer para crear un enlace. El enlace ser@'a almacenado para posteriores inserciones dentro de un b@'uffer Org (ver m@'as abajo).

source: Insert a link. This prompts for a link to be inserted into the buffer. You can just type a link, or use history keys @key{up} and @key{down} to access stored links. You will be prompted for the description part of the link. When called with a @kbd{C-u} prefix argument, file name completion is used to link to a file.
es: Inserta un enlace. Esto sugiere un enlace que ser@'a insertado dentro del b@'uffer. Se puede escribir un enlace, o usar la teclas del historial @key{arriba} y @key{abajo} para acceder a los enlaces almacenados. Tambi@'en se consultar@'a por la parte de descripci@'on del enlace. Cuando se llama al prefijo @kbd{C-u}, se usa el autocompletado del nombre del fichero para enlazar a un fichero.

source: C-c C-l @r{(with cursor on existing link)}
es: C-c C-l @r{(con el cursor en un enlace existente)}

source: When the cursor is on an existing link, @kbd{C-c C-l} allows you to edit the link and description parts of the link.
es: Cuando el cursor est@'a en enlace existente, @kbd{C-c C-l} permite editar el enlace y las partes de descripci@'on del enlace.

source: C-c C-o @r{or} mouse-1 @r{or} mouse-2
es: C-c C-o @r{o} mouse-1 @r{o} mouse-2

source: Open link at point.
es: Abre el enlace en el que est@'a el cursor.

source: Jump back to a recorded position. A position is recorded by the commands following internal links, and by @kbd{C-c %}. Using this command several times in direct succession moves through a ring of previously recorded positions.
es: Salta a una posici@'on guardada. Una posici@'on se guarda con los siguientes comandos de enlaces internos, y por @kbd{C-c %}. Usando este comando varias veces se mueve a trav@'es de un anillo de posiciones previamente grabadas en una sucesi@'on directa.

source: File links can contain additional information to make Emacs jump to a particular location in the file when following a link. This can be a line number or a search option after a double colon.
es: Los enlaces de ficheros pueden contener informaci@'on adicional para hacer que Emacs salte a una posici@'on particular en el fichero cuando se sigue un enlace. Esto puede ser un n@'umero de l@'{@dotless{i}}nea o una opci@'on de b@'usqueda despu@'es de los dos puntos dobles.

source: Here is the syntax of the different ways to attach a search to a file link, together with an explanation:
es: Aqu@'{@dotless{i}} est@'a la sintaxis de los diferentes caminos para adjuntar una b@'usqueda a un enlace de fichero, junto con una explicaci@'on:

source: [[file:~/code/main.c::255]] @r{Find line 255} [[file:~/xx.org::My Target]] @r{Find @samp{<<My Target>>}} [[file:~/xx.org::#my-custom-id]] @r{Find entry with custom id}
es: [[file:~/code/main.c::255]] @r{Encontrar l@'{@dotless{i}}nea 255} [[file:~/xx.org::Mi Objetivo]] @r{Encontrar @samp{<<Mi Objetivo>>}} [[file:~/xx.org::#mi-id-personal]] @r{Encontrar entrada con id personal}

source: @seealso{ @uref{https://orgmode.org/manual/Hyperlinks.html#Hyperlinks, Chapter 4 of the manual}}
es: @seealso{ @uref{https://orgmode.org/manual/Hyperlinks.html#Hyperlinks, Cap@'{@dotless{i}}tulo 4 del manual}}

source: Org mode does not require TODO lists to live in separate documents. Instead, TODO items are part of a notes file, because TODO items usually come up while taking notes! With Org mode, simply mark any entry in a tree as being a TODO item. In this way, information is not duplicated, and TODO items remain in the context from which they emerged.
es: Org mode no requiere listas TODO que est@'en en documentos separados. En vez de eso, los @'{@dotless{i}}tems TODO son parte de ficheros de notas, porque los @'{@dotless{i}}tems TODO normalmente llegan mientras se toman notas. Con Org mode, simplemente marca cualquier entrada en un @'arbol siendo un @'{@dotless{i}}tem TODO. De este modo, la informaci@'on no est@'a duplicada, y los @'{@dotless{i}}tems TODO permanecen en el contexto emergente.

source: Org mode providing methods to give you an overview of all the things that you have to do, collected from many files.
es: Org mode provee m@'etodos para dar una visi@'on de todas las cosas que se tienen que hacer, a veces llegan desde muchos ficheros.

source: Any headline becomes a TODO item when it starts with the word @samp{TODO}, for example:
es: Cualquier t@'{@dotless{i}}tulo o subt@'{@dotless{i}}tulo puede llegar a ser un @'{@dotless{i}}tem TODO cuando empieza con la palabra @samp{TODO}, por ejemplo:

source: *** TODO Write letter to Sam Fortune
es: *** TODO Escribir carta a Santa Fortuna

source: The most important commands to work with TODO entries are:
es: Los comandos m@'as importantes para trabajar con entradas TODO son:

source: Rotate the TODO state of the current item among
es: Rotar el estado TODO del @'{@dotless{i}}tem actual

source: (unmarked) -> TODO -> DONE -> (unmarked)
es: (no marcado) -> TODO -> DONE -> (no marcado)\n

source: The same rotation can also be done ``remotely'' from the timeline and agenda buffers with the @kbd{t} command key (@pxref{Agenda commands}).
es: La misma rotaci@'on puede tambi@'en ser hecha ``de manera remota'' desde los b@'uffers de agenda y l@'{@dotless{i}}nea de tiempo con la tecla @kbd{t} (@pxref{Comandos de la agenda}).

source: S-@key{right}@r{/}@key{left}
es: S-@key{derecha}@r{/}@key{izquierda}

source: Select the following/preceding TODO state, similar to cycling.
es: Seleccionar el siguiente/precedente estado TODO, similar a rotar.

source: View TODO items in a @emph{sparse tree} (@pxref{Sparse trees}). Folds the buffer, but shows all TODO items and the headings hierarchy above them.
es: Ver @'{@dotless{i}}tems TODO en un @emph{@'arbol poco denso} (@pxref{@'Arboles poco densos}). Encoge el b@'uffer, pero muestra todos los @'{@dotless{i}}tems y la jerarqu@'{@dotless{i}}a de t@'{@dotless{i}}tulos y subt@'{@dotless{i}}tulos por encima de ellos.

source: Show the global TODO list. Collects the TODO items from all agenda files (@pxref{Agenda Views}) into a single buffer. @xref{Global TODO list}, for more information.
es: Muestra la lista global TODO. Esta colecci@'on de @'{@dotless{i}}tems TODO de todos los archivos de la agenda (@pxref{Vistas de la Agenda}) en un @'unico b@'uffer.

source: Insert a new TODO entry below the current one.
es: Inserta una nueva entrada TODO debajo del @'{@dotless{i}}tem actual.

source: Changing a TODO state can also trigger tag changes. See the docstring of the option @code{org-todo-state-tags-triggers} for details.
es: Al cambiar el estado de un @'{@dotless{i}}tem TODO se puede tambi@'en activar cambios de etiqueta. V@'ease la documentaci@'on de la opci@'on @code{org-todo-state-tags-triggers} para m@'as detalles.

source: You can use TODO keywords to indicate @emph{sequential} working progress states:
es: Se pueden usar palabras reservadas TODO para indicar diferentes estados @emph{secuenciales} en el proceso de trabajo:

source: The vertical bar separates the TODO keywords (states that @emph{need action}) from the DONE states (which need @emph{no further action}). If you don't provide the separator bar, the last state is used as the DONE state. With this setup, the command @kbd{C-c C-t} will cycle an entry from TODO to FEEDBACK, then to VERIFY, and finally to DONE and DELEGATED. Sometimes you may want to use different sets of TODO keywords in parallel. For example, you may want to have the basic @code{TODO}/@code{DONE}, but also a workflow for bug fixing. Your setup would then look like this:
es: La barra vertical separa las palabras reservadas TODO (estados que @emph{necesitan acci@'on}) de los estados DONE (realizados, que @emph{no necesitan m@'as acci@'on}). Si no se proporciona la barra separadora, el @'ultimo estado es usado como estado DONE. Con esta configuraci@'on, el comando @kbd{C-c C-t} rotar@'a una entrada desde TODO a FEEDBACK, despu@'es a VERIFY y finalmente a DONE y DELEGATED.

source: The keywords should all be different, this helps Org mode to keep track of which subsequence should be used for a given entry. The example also shows how to define keys for fast access of a particular state, by adding a letter in parenthesis after each keyword---you will be prompted for the key after @kbd{C-c C-t}.
es: Las palabras reservadas son todas diferentes, esto ayuda a Org mode a guardar la traza de la subsecuencia que deber@'{@dotless{i}}a ser usada para una entrada dada. El ejemplo tambi@'en muestra c@'omo definir teclas para un r@'apido acceso a un estado particular, a@~nadiendo una letra entre par@'entesis, as@'{@dotless{i}} al pulsar @kbd{C-c C-t} se pregunta por la letra para cada palabra reservada que se quiere escoger.

source: To define TODO keywords that are valid only in a single file, use the following text anywhere in the file.
es: Para definir palabras reservadas TODO que son v@'alidas @'unicamente en un solo fichero, use el siguiente texto en cualquier lugar del fichero.

source: After changing one of these lines, use @kbd{C-c C-c} with the cursor still in the line to make the changes known to Org mode.
es: Despu@'es de cambiar una de estas l@'{@dotless{i}}neas, use @kbd{C-c C-c} con el cursor todav@'{@dotless{i}}a en la l@'{@dotless{i}}nea para que Org mode reconozca los cambios.

source: Org mode can automatically record a timestamp and possibly a note when you mark a TODO item as DONE, or even each time you change the state of a TODO item. This system is highly configurable; settings can be on a per-keyword basis and can be localized to a file or even a subtree. For information on how to clock working time for a task, see @ref{Clocking work time}.
es: Org mode puede grabar autom@'aticamente una marca de tiempo @emph{timestamp} y posiblemente una nota cuando se marca un @'{@dotless{i}}tem TODO como DONE, @'o incluso cada vez que se cambia el estado de un @'{@dotless{i}}tem TODO. Este sistema es altamente configurable; las configuraciones pueden seguir una l@'ogica por tecla y pueden afectar a un fichero o incluso a un sub@'arbol. Para m@'as informaci@'on de c@'omo fijar fecha y hora de una tarea, lea la @ref{Estableciendo tiempo de trabajo}.

source: The most basic logging is to keep track of @emph{when} a certain TODO item was finished. This is achieved with@footnote{The corresponding in-buffer setting is: @code{#+STARTUP: logdone}}.
es: El registro m@'as b@'asico es guardar @emph{cuando} un @'{@dotless{i}}tem TODO se finaliza. Esto se logra con@footnote{La correspondiente configuraci@'on en el b@'uffer es @code{#+STARTUP: logdone}}.

source: Then each time you turn an entry from a TODO (not-done) state into any of the DONE states, a line @samp{CLOSED: [timestamp]} will be inserted just after the headline. If you want to record a note along with the timestamp, use@footnote{The corresponding in-buffer setting is: @code{#+STARTUP: lognotedone}}
es: As@'{@dotless{i}}, cada vez que se cambia una entrada desde un estado TODO (no DONE) a cualquiera de los estados DONE, una l@'{@dotless{i}}nea @samp{CLOSED: [timestamp]} ser@'a insertada justo despu@'es de la cabecera. Si se quiere grabar una nota con una marca de tiempo @emph{timestamp} use lo siguiente:@footnote{La correspondiente configuraci@'on en el b@'uffer es: @code{#+STARTUP: lognotedone}}

source: You will then be prompted for a note, and that note will be stored below the entry with a @samp{Closing Note} heading.
es: Entonces, se preguntar@'a por la nota, y la nota ser@'a almacenada debajo de la entrada con una cabecera Cerrar nota @emph{Closing Note}.

source: You might want to keep track of TODO state changes. You can either record just a timestamp, or a time-stamped note for a change. These records will be inserted after the headline as an itemized list. When taking a lot of notes, you might want to get the notes out of the way into a drawer. Customize the variable @code{org-log-into-drawer} to get this behavior.
es: Se podr@'{@dotless{i}}a querer guardar la traza de cambios de estado TODO. Para un cambio se puede registrar solo la marca de tiempo (timestamp), o adem@'as una nota con una marca de tiempo para un cambio. Estos registros ser@'an insertados despu@'es de la cabecera como una lista de @'{@dotless{i}}tems. Cuando se toman un mont@'on de notas, se podr@'{@dotless{i}}a querer tener las notas fuera de la vista dentro de un "@i{caj@'on}" (drawer)

source: For state logging, Org mode expects configuration on a per-keyword basis. This is achieved by adding special markers @samp{!} (for a timestamp) and @samp{@@} (for a note) in parentheses after each keyword. For example:
es: Para el registro de estados, Org mode conf@'{@dotless{i}}a en una configuraci@'on basada en palabras reservadas. Esto se logra a@~nadiendo marcas especiales @samp{!} (para una marca de tiempo) y @samp{@@} (para una nota) entre par@'entesis despu@'es de cada palabra reservada. Por ejemplo:

source: will define TODO keywords and fast access keys, and also request that a time is recorded when the entry is set to DONE, and that a note is recorded when switching to WAIT or CANCELED. The same syntax works also when setting @code{org-todo-keywords}.
es: definir@'a las palabras reservadas TODO y el acceso a los atajos de teclado, y tambi@'en solicita que se grabe el momento en el que la entrada se estableci@'o como DONE, y que una nota se grabe al cambiar a WAIT o CANCELED. La misma sintaxis funciona tambi@'en cuando se define @code{org-todo-keywords}.

source: If you use Org mode extensively, you may end up with enough TODO items that it starts to make sense to prioritize them. Prioritizing can be done by placing a @emph{priority cookie} into the headline of a TODO item, like this
es: Si se usa Org mode intensamente, se puede acabar con suficientes @'{@dotless{i}}tems TODO de manera que empiece a tener sentido priorizarlos. Priorizar puede ser hecho poniendo una @emph{marca de prioridad} en la cabecera de un @'{@dotless{i}}tem TODO, como esta:

source: *** TODO [#A] Write letter to Sam Fortune
es: *** TODO [#A] Escribir carta a Santa Fortuna

source: Org mode supports three priorities: @samp{A}, @samp{B}, and @samp{C}. @samp{A} is the highest, @samp{B} the default if none is given. Priorities make a difference only in the agenda.
es: Org mode soporta tres prioridades: @samp{A}, @samp{B}, @samp{C}. @samp{A} es la m@'as alta, por defecto ser@'a @samp{B} si no se da ninguna. Las prioridades marcan diferencia s@'olo en la agenda.

source: Set the priority of the current headline. Press @samp{A}, @samp{B} or @samp{C} to select a priority, or @key{SPC} to remove the cookie.
es: Pone una prioridad a la actual cabecera. Presionando @samp{A}, @samp{B} o @samp{C} se selecciona la prioridad, o @key{SPC} para eliminar la marca.

source: Increase/decrease priority of current headline
es: Incremente/decrementa la prioridad de la cabecera actual

source: Breaking tasks down into subtasks
es: Partiendo tareas en subtareas

source: It is often advisable to break down large tasks into smaller, manageable subtasks. You can do this by creating an outline tree below a TODO item, with detailed subtasks on the tree. To keep the overview over the fraction of subtasks that are already completed, insert either @samp{[/]} or @samp{[%]} anywhere in the headline. These cookies will be updated each time the TODO status of a child changes, or when pressing @kbd{C-c C-c} on the cookie. For example:
es: Es a menudo ventajoso dividir grandes tareas en peque@~nas y manejables subtareas. Puede realizar esto creando un @'arbol de ideas (outlines) bajo un @'{@dotless{i}}tem TODO, el cual detalla las subtareas en el @'arbol. Para poner la vista sobre la fracci@'on de subtareas que est@'an ya completadas, inserte un @samp{[/]} o @samp{[%]} en cualquier lugar de la cabecera. Estas marcas ser@'an actualizadas cada vez que el estado TODO de alg@'un hijo cambie, o se presione @kbd{C-c C-c} en la marca. Por ejemplo:

source: * Organize Party [33%] ** TODO Call people [1/2] *** TODO Peter *** DONE Sarah ** TODO Buy food ** DONE Talk to neighbor
es: * Organizar Fiesta [33%] ** TODO Llamar a la gente [1/2] *** TODO Pedro *** DONE Sara ** TODO Comprar comida ** DONE Hablar con el vecino

source: Every item in a plain list (@pxref{Plain lists}) can be made into a checkbox by starting it with the string @samp{[ ]}. Checkboxes are not included in the global TODO list, so they are often great to split a task into a number of simple steps. Here is an example of a checkbox list.
es: Cada @'{@dotless{i}}tem en una lista plana (@pxref{Listas planas}) puede ser un cuadro de chequeo comenzando con la cadena @samp{[ ]}. Los cuadros de chequeo no est@'an incluidos en la lista TODO global, as@'{@dotless{i}} a menudo es preferible dividir la tarea en un n@'umero reducido de pasos. V@'ease el siguiente ejemplo de una lista de chequeo:

source: * TODO Organize party [1/3] - [-] call people [1/2] - [ ] Peter - [X] Sarah - [X] order food
es: * TODO Organizar Fiesta [1/3] - [-] Llamar a la gente [1/2] - [ ] Pedro - [X] Sara - [X] Comprar comida - [ ] pensar qu@'e m@'usica escuchar

source: Checkboxes work hierarchically, so if a checkbox item has children that are checkboxes, toggling one of the children checkboxes will make the parent checkbox reflect if none, some, or all of the children are checked.
es: Las cajas de chequeo funcionan jer@'arquicamente, si un @'{@dotless{i}}tem es caja de chequeo y tiene hijos que son cajas de chequeo, marcando las cajas de chequeo hijos se marcar@'a la caja de chequeo del padre para reflejar si ninguno, alguno o todos los hijos est@'an marcados.

source: The following commands work with checkboxes:
es: El siguiente comando funciona con cajas de chequeo @samp{checkboxes}:

source: Toggle checkbox status or (with prefix arg) checkbox presence at point.
es: Cambia el estado de la caja de chequeo o (con prefijo) a@~nade una caja de chequeo.

source: Insert a new item with a checkbox. This works only if the cursor is already in a plain list item (@pxref{Plain lists}).
es: Inserta un nuevo @'{@dotless{i}}tem con un cuadro de chequeo. Esto funciona solo si el cursor est@'a en un @'{@dotless{i}}tem de la lista plana (@pxref{Listas planas}).

source: @seealso{ @uref{https://orgmode.org/manual/TODO-Items.html#TODO-Items, Chapter 5 of the manual}@* @uref{https://orgmode.org/worg/org-tutorials/orgtutorial_dto.php, David O'Toole's introductory tutorial}@* @uref{http://members.optusnet.com.au/~charles57/GTD/gtd_workflow.html, Charles Cave's GTD setup}}
es: @seealso{ @uref{https://orgmode.org/manual/TODO-Items.html#TODO-Items, Cap@'{@dotless{i}}tulo 5 del manual}@* @uref{https://orgmode.org/worg/org-tutorials/ orgtutorial_dto.php, Tutorial de introducci@'on de David O'Toole}@* @uref{http:// members.optusnet.com.au/~charles57/GTD/gtd_workflow.html, Configuraci@'on de GTD de Charles Cave}}

source: An excellent way to implement labels and contexts for cross-correlating information is to assign @i{tags} to headlines. Org mode has extensive support for tags.
es: Una excelente forma de nombrar y contextualizar informaci@'on interrelacionada es asignar @i{etiquetas} a las cabeceras. Org mode tiene un amplio soporte para etiquetas. @footnote{Nota del Traductor: Tanto label como tag se traduce como etiqueta. En general, label se utiliza más como nombre que se le asigna a algo y tag como palabra clave, si bien ambas suelen traducirse como etiqueta. As@'{@dotless{i}}, he decidido traducir @i{implement label} como nombrar y @i{tag} como etiqueta.}

source: Every headline can contain a list of tags; they occur at the end of the headline. Tags are normal words containing letters, numbers, @samp{_}, and @samp{@@}. Tags must be preceded and followed by a single colon, e.g., @samp{:work:}. Several tags can be specified, as in @samp{:work:urgent:}. Tags will by default be in bold face with the same color as the headline.
es: Cada cabecera puede contener una lista de etiquetas; dicha lista se introduce al final de la cabecera correspondiente. Las etiquetas son palabras normales conteniendo letras, números, @samp{_} y @samp{@@}. Las etiquetas deben estar precedidas y seguidas por dos puntos, por ejemplo, @samp{:trabajo:}. Es posible asignar varias etiquetas, como en @samp{:trabajo:urgente:}. Las etiquetas por defecto estar@'an en negrilla con el mismo color que la cabecera.

source: @i{Tags} make use of the hierarchical structure of outline trees. If a heading has a certain tag, all subheadings will inherit the tag as well. For example, in the list
es: Las @i{etiquetas} hacen uso de la estructura jer@'arquica de los @'arboles de org-mode. Si una cabecera tiene una cierta etiqueta, todas las subcabeceras heredar@'an la etiqueta tambi@'en. Por ejemplo, en la lista

source: * Meeting with the French group :work: ** Summary by Frank :boss:notes: *** TODO Prepare slides for him :action:
es: * Encuentro con franceses :trabajo: ** Resumen para Carolina :jefa:notas: *** TODO Preparar presentaciones para ella :actividad:

source: the final heading will have the tags @samp{:work:}, @samp{:boss:}, @samp{:notes:}, and @samp{:action:} even though the final heading is not explicitly marked with those tags. You can also set tags that all entries in a file should inherit just as if these tags were defined in a hypothetical level zero that surrounds the entire file. Use a line like this@footnote{As with all these in-buffer settings, pressing @kbd{C-c C-c} activates any changes in the line.}:
es: La cabecera final tendr@'a las etiquetas @samp{:trabajo:}, @samp{:jefa:}, @samp{:notas:} y @samp{:actividad:} incluso aunque la cabecera final no est@'e expl@'{@dotless{i}}citamente marcada con estas etiquetas. Se pueden tambi@'en asignar etiquetas para que todas las entradas en un fichero hereden si estas etiquetas fueron definidas en un hipot@'etico nivel cero alrededor del fichero entero. Usa una l@'{@dotless{i}}nea como esta@footnote{Como siempre estas configuraciones de b@'uffer se activan presionando @kbd{C-c C-c}.}:

source: #+FILETAGS: :Peter:Boss:Secret:
es: #+FILETAGS: :Pedro:Jefe:Secreto:

source: Tags can simply be typed into the buffer at the end of a headline. After a colon, @kbd{M-@key{TAB}} offers completion on tags. There is also a special command for inserting tags:
es: Las etiquetas pueden simplemente ser escritas en un b@'uffer al final de una cabecera. Despu@'es de los dos puntos, @kbd{M-@key{TAB}} autocompleta etiquetas. Hay tambi@'en un comando para insertar etiquetas:
