Repository: bzg/worg
Catalog: orgguide/orgguide.*.po
Languages: es

source: Some backends allow you to directly include images into the exported document. Org does this, if a link to an image files does not have a description part, for example @code{[[./img/a.jpg]]}. If you wish to define a caption for the image and maybe a label for internal cross references, you sure that the link is on a line by itself precede it with:
es: Algunos lenguajes de marcado permiten directamente incluir im@'agenes dentro del documento exportado. Org hace esto, si un enlace a ficheros de im@'agenes no tiene una parte de descripci@'on, por ejemplo @code{[[./img/a.jpg]]}. Si se desea definir una captura para la imagen y puede ser una etiqueta para referencias cruzadas internas, se debe asegurar que el enlace est@'a en una l@'{@dotless{i}}nea por s@'{@dotless{i}} misma precedida con:

source: #+CAPTION: This is the caption for the next figure link (or table) #+NAME: fig:SED-HR4049 [[./img/a.jpg]]
es: #+CAPTION: Este es el t@'{@dotless{i}}tulo para el siguiente enlace fig (o tabla) #+NAME: fig:SED-HR4049 [[./img/a.jpg]]

source: The same caption mechanism applies to other structures than images and tables (e.g., @LaTeX{} equations, source code blocks), provided the chosen export back-end supports them.
es: El mismo mecanismo de captura se aplica a otras estructuras en vez de im@'agenes y tablas (por ej: ecuaciones @LaTeX{}, bloques de c@'odigo), provistos por la exportaci@'on elegida y el lenguaje de marcado que los soporta.

source: You can include literal examples that should not be subjected to markup. Such examples will be typeset in monospace, so this is well suited for source code and similar examples.
es: Se pueden incluir ejemplos literales que no deber@'{@dotless{i}}an ser asunto de marcado. Tales ejemplos ser@'an tipografiados en monospacio, as@'{@dotless{i}} est@'a bien situado para el c@'odigo fuente y ejemplos similares.

source: #+BEGIN_EXAMPLE Some example from a text file. #+END_EXAMPLE
es: #+BEGIN_EXAMPLE Alg@'un ejemplo desde un fichero de texto. #+END_EXAMPLE

source: For simplicity when using small examples, you can also start the example lines with a colon followed by a space. There may also be additional whitespace before the colon:
es: Por simplicidad cuando se usan ejemplos peque@~nos, se puede tambi@'en empezar l@'{@dotless{i}}neas con dos puntos seguidos por un espacio. Tambi@'en puede haber espacios en blanco adicionales antes de los dos puntos:

source: Here is an example : Some example from a text file.
es: Aqu@'{@dotless{i}} est@'a un ejemplo : Alg@'un ejemplo desde un fichero de texto.

source: For source code from a programming language, or any other text that can be marked up by font-lock in Emacs, you can ask for it to look like the fontified Emacs buffer
es: Para c@'odigo fuente desde un lenguaje de programaci@'on, o cualquier otro texto que puede ser marcado por bloque de fuentes en Emacs, se puede preguntar para ello para mirar como el b@'uffer de Emacs fontificado.

source: #+BEGIN_SRC emacs-lisp (defun org-xor (a b) "Exclusive or." (if a (not b) b)) #+END_SRC
es: #+BEGIN_SRC emacs-lisp (defun org-xor (a b) "or exclusiva." (if a (not b) b)) #+END_SRC

source: To edit the example in a special buffer supporting this language, use @kbd{C-c '} to both enter and leave the editing buffer.
es: Para editar el ejemplo en un b@'uffer especial soportando este lenguaje, usa @kbd{C-c '} para ambos entrar y dejar el b@'uffer de edici@'on.

source: During export, you can include the content of another file. For example, to include your @file{.emacs} file, you could use:
es: Durante la exportaci@'on, se pueden incluir el contenido de otro fichero. Por ejemplo, para incluir tu fichero @file{.emacs}, se podr@'{@dotless{i}}a usar:

source: The optional second and third parameter are the markup (i.e., @samp{example} or @samp{src}), and, if the markup is @samp{src}, the language for formatting the contents. The markup is optional, if it is not given, the text will be assumed to be in Org mode format and will be processed normally. File-links will be interpreted as well:
es: Los par@'ametros opcionales segundo y tercero son la marca (e.g.@: @samp{ejemplo}, o @samp{fuente}), y, si la marca es @samp{fuente}, el lenguaje formatea los contenidos. La marca es opcional, si no es dada, el texto se asume para estar en el formato de Org mode y ser@'a procesado normalmente. Los enlaces de fichero ser@'an interpretados as@'{@dotless{i}}:

source: @kbd{C-c '} will visit the included file.
es: @kbd{C-c '} visitar@'a el fichero incluido.

source: For scientific notes which need to be able to contain mathematical symbols and the occasional formula, Org-mode supports embedding @LaTeX{} code into its files. You can directly use TeX-like syntax for special symbols, enter formulas and entire @LaTeX{} environments.
es: Para notas cient@'{@dotless{i}}ficas que necesitan ser capaces de contener s@'{@dotless{i}}mbolos matem@'aticos y la f@'ormula ocasional, Org-mode soporta c@'odigo @LaTeX{} embebido dentro de sus ficheros. Se puede directamente usar sintaxis Tex para s@'{@dotless{i}}mbolos especiales, e introducir f@'ormulas y entornos @LaTeX{} completos.

source: Angles are written as Greek letters \alpha, \beta and \gamma. The mass if the sun is M_sun = 1.989 x 10^30 kg. The radius of the sun is R_@{sun@} = 6.96 x 10^8 m. If $a^2=b$ and $b=2$, then the solution must be either $a=+\sqrt@{2@}$ or $a=-\sqrt@{2@}$.
es: Los @'angulos son escritos como letras Griegas \alpha, \beta y \gamma. La masa si el sol es M_sol = 1.989 x 10^30 kg. El radio del sol es R_@{sol@} = 6.96 x 10^8 m. Si $a^2=b$ y $b=2$, entonces la soluci@'on debe ser $a=+\sqrt@{2@}$ o $a=-\sqrt@{2@}$.

source: With @uref{https://orgmode.org/manual/LaTeX-fragments.html#LaTeX-fragments,special setup}, @LaTeX{} snippets will be included as images when exporting to HTML.
es: Con @uref{https://orgmode.org/manual/LaTeX-fragments.html#LaTeX-fragments, configuraci@'on especial}, trozos de @LaTeX{} ser@'an incluidos como im@'agenes cuando se exporta a HTML.

source: @seealso{ @uref{https://orgmode.org/manual/Markup.html#Markup, Chapter 11 of the manual}}
es: @seealso{ @uref{https://orgmode.org/manual/Markup.html#Markup, Cap@'{@dotless{i}}tulo 11 del manual}}

source: Org-mode documents can be exported into a variety of other formats: ASCII export for inclusion into emails, HTML to publish on the web, @LaTeX{}/PDF for beautiful printed documents and DocBook to enter the world of many other formats using DocBook tools. There is also export to iCalendar format so that planning information can be incorporated into desktop calendars.
es: Los documentos Org-mode pueden exportarse a una variedad de otros formatos: ASCII para su inclusi@'on en correos electr@'onicos, HTML para su publicaci@'on en la web, @LaTeX{}/PDF para bellos documentos impresos y DocBook para entrar a un mundo de muchos formatos. Adem@'as puede exportarse al formato iCalendar, as@'{@dotless{i}} la informaci@'on de planificaci@'on puede ser incorporada a calendarios de escritorio.

source: The exporter recognizes special lines in the buffer which provide additional information. These lines may be put anywhere in the file. The whole set of lines can be inserted into the buffer with @kbd{C-c C-e #}.
es: El exportador reconoce l@'{@dotless{i}}neas especiales en el b@'uffer que proporcionan informaci@'on adicional. Estas l@'{@dotless{i}}neas pueden ser puestas en cualquier lugar del fichero. El conjunto completo de l@'{@dotless{i}}neas que pueden ser insertadas dentro del b@'uffer con @kbd{C-c C-e #}.

source: Insert template with export options, see example below.
es: Inserta plantilla con opciones de exportaciones, ver ejemplo de debajo.

source: #+TITLE: the title to be shown #+AUTHOR: the author (default taken from @code{user-full-name}) #+DATE: a date, fixed, or an Org timestamp #+EMAIL: his/her email address (default from @code{user-mail-address}) #+DESCRIPTION: the page description, e.g.@: for the XHTML meta tag #+KEYWORDS: the page keywords, e.g.@: for the XHTML meta tag #+LANGUAGE: language, e.g.@: @samp{en} (@code{org-export-default-language}) #+OPTIONS: H:2 num:t toc:t \n:nil ::t |:t ^:t f:t tex:t ...
es: #+TITLE: el t@'{@dotless{i}}tulo que ser@'a mostrado #+AUTHOR: el autor (por defecto tomado desde @code{user-full-name}) #+DATE: una fecha, fija, o una marca de tiempo Org #+EMAIL: su direcci@'on de correo (por defecto desde @code{user-mail-address}) #+DESCRIPTION: la descripci@'on de la p@'agina e.g.@: para la meta etiqueta XHTML #+KEYWORDS: la p@'agina de palabras clave (@samp{keywords}), e.g.@: para la meta etiqueta XHTML #+LANGUAGE: lenguaje, por ej.@: @samp{en} (@code{org-export-default-language}) #+OPTIONS: H:2 num:t toc:t \n:nil @@:t ::t |:t ^:t f:t teX:t ...

source: All export commands can be reached using the export dispatcher, which is a prefix key that prompts for an additional key specifying the command. Normally the entire file is exported, but if a region is active, it will be exported instead.
es: Todos los comandos de exportaci@'on se pueden lograr usando el dispensador o disparador de exportaci@'on, que es una clave prefija que muestra una clave adicional especificando el comando. Normalmente el fichero entero es exportado, pero si hay una regi@'on activa tambi@'en se exportar@'a.

source: Dispatcher for export and publishing commands.
es: Disparador para exportar y publicar comandos.

source: ASCII export produces a simple and very readable version of an Org-mode file, containing only plain ASCII. Latin-1 and UTF-8 export augment the file with special characters and symbols available in these encodings.
es: La exportaci@'on ASCII produce una simple y muy legible versi@'on de un fichero Org-mode, conteniendo solo ASCII plano. Con Latin-1 y UTF-8 se exporta aumentando el fichero con car@'acteres especiales y s@'{@dotless{i}}mbolos disponibles en estas codificaciones.

source: C-c C-e t a @ @ @r{and} @ @ C-c C-e t A
es: C-c C-e t a @ @ @r{y} @ @ C-c C-e t A

source: Export as ASCII file or temporary buffer.
es: Exportar como un fichero ASCII o b@'uffer temporal.

source: C-c C-e t n @ @ @r{and} @ @ C-c C-e t N
es: C-c C-e t n @ @ @r{y} @ @ C-c C-e t N

source: Like the above commands, but use Latin-1 encoding.
es: Como los comandos de arriba, pero usa codificaci@'on Latin-1.

source: C-c C-e t u @ @ @r{and} @ @ C-c C-e t U
es: C-c C-e t u @ @ @r{y} @ @ C-c C-e t U

source: Like the above commands, but use UTF-8 encoding.
es: Como los comandos de arriba, pero usa codificaci@'on UTF-8.

source: Export as HTML file @file{myfile.html}.
es: Exportar como un fichero HTML @file{myfile.html}.

source: Export as HTML file and immediately open it with a browser.
es: Exportar como fichero HTML e inmediatamente lo abre con un navegador.

source: To insert HTML that should be copied verbatim to the exported file use either
es: Para insertar el HTML que debe copiarse literalmente para al fichero exportado que usa otro

source: #+HTML: Literal HTML code for export
es: #+HTML: C@'odigo Literal HTML para exportar

source: or
es: o

source: #+BEGIN_HTML All lines between these markers are exported literally #+END_HTML
es: #+BEGIN_HTML Todas las l@'{@dotless{i}}neas entre estos marcadores son exportados literalmente #+END_HTML

source: Export as @LaTeX{} file @file{myfile.tex}.
es: Exporta como fichero @LaTeX{} @file{myfile.tex}.

source: Export as @LaTeX{} and then process to PDF.
es: Exportando a @LaTeX{} y procesando a PDF

source: Export as @LaTeX{} and then process to PDF, then open the resulting PDF file.
es: Exportando a @LaTeX{} y procesando a PDF, entonces se abre el fichero PDF resultante.

source: By default, the @LaTeX{} output uses the class @code{article}. You can change this by adding an option like @code{#+LATEX_CLASS: myclass} in your file. The class must be listed in @code{org-latex-classes}.
es: Por defecto, la salida @LaTeX{} usa la clase @code{article}. Se puede cambiar esto para a@~nadir una opci@'on como @code{#+LaTeX_CLASS: myclass} en su fichero. La clase debe ser listada en @code{org-export-latex-classes}.

source: Embedded @LaTeX{} as described in @ref{Embedded @LaTeX{}}, will be correctly inserted into the @LaTeX{} file. Similarly to the HTML exporter, you can use @code{#+LATEX:} and @code{#+BEGIN_LATEX ... #+END_LATEX} construct to add verbatim @LaTeX{} code.
es: El @LaTeX{} embebido como se describe en @ref{@LaTeX{} embebido}, ser@'a correctamente insertado dentro del fichero @LaTeX{}. De manera similar, al exportador HTML, se puede usar @code{#+LaTeX:} y la construcci@'on @code{#+BEGIN_LaTeX ... #+END_LaTeX} para a@~nadir c@'odigo @LaTeX{} literal.

source: Create iCalendar entries for the current file in a @file{.ics} file.
es: Crea entradas iCalendar para el fichero actual en un fichero @file{.ics}.

source: Create a single large iCalendar file from all files in @code{org-agenda-files} and write it to the file given by @code{org-icalendar-combined-agenda-file}.
es: Crea un fichero simple pero largo iCalendar de todos los ficheros en @code{org-agenda-files} y los escribe al fichero dado por @code{org-icalendar-combined-agenda-file}.

source: @seealso{ @uref{https://orgmode.org/manual/Exporting.html#Exporting, Chapter 12 of the manual}@* @uref{https://orgmode.org/worg/org-tutorials/images-and-xhtml-export.php, Sebastian Rose's image handling tutorial}@* @uref{http://orgmode.org/worg/org-tutorials/org-latex-export.php, Thomas Dye's LaTeX export tutorial} @uref{https://orgmode.org/worg/org-tutorials/org-beamer/tutorial.php, Eric Fraga's BEAMER presentation tutorial}}
es: @seealso{ @uref{https://orgmode.org/manual/Exporting.html#Exporting, Cap@'{@dotless{i}}tulo 12 del manual}@* @uref{https://orgmode.org/worg/org-tutorials/images-and-xhtml-export.php, Tutorial de Sebastian Rose de manejo de im@'agenes}@* @uref{https://orgmode.org/worg/org-tutorials/org-latex-export.php, Tutorial de exportaci@'on de LaTeX de Thomas Dye} @uref{https://orgmode.org/worg/org-tutorials/org-beamer/tutorial.php, Tutorial de presentaciones de BEAMER de Eric Fraga}}

source: Org includes a publishing management system that allows you to configure automatic HTML conversion of @emph{projects} composed of interlinked org files. You can also configure Org to automatically upload your exported HTML pages and related attachments, such as images and source code files, to a web server. For detailed instructions about setup, see the manual.
es: Org incluye un sistema de gesti@'on de publicaci@'on que permite configurar la conversi@'on HTML de @emph{proyectos} compuestos de ficheros org entrelazados. Se puede tambi@'en configurar Org para autom@'aticamente subir las p@'aginas HTML y adjuntos relacionados, tales como im@'agenes y ficheros de c@'odigo fuente, a un servidor web. Para instrucciones detalladas acerca de la configuraci@'on, ver el manual.

source: Here is an example:
es: Aqu@'{@dotless{i}} hay un ejemplo:

source: Prompt for a specific project and publish all files that belong to it.
es: Pregunta por un proyecto espec@'{@dotless{i}}fico y publica todos los ficheros que pertenecen a él.

source: Publish the project containing the current file.
es: Publica el proyecto que contiene el fichero actual.

source: Publish only the current file.
es: Elimina la columna actual.

source: Publish every project.
es: Publica cada proyecto

source: Org uses timestamps to track when a file has changed. The above functions normally only publish changed files. You can override this and force publishing of all files by giving a prefix argument to any of the commands above.
es: Org usa marcas de tiempo para trazar cuando un fichero ha cambiado. Las funciones de debajo normalmente solo publican ficheros modificados. Se puede sobreescribir esto y forzar la publicaci@'on de todos los ficheros dando un argumento prefijo para cualquiera de los comandos de debajo.

source: @seealso{ @uref{https://orgmode.org/manual/Publishing.html#Publishing, Chapter 13 of the manual}@* @uref{https://orgmode.org/worg/org-tutorials/org-publish-html-tutorial.php, Sebastian Rose's publishing tutorial}@* @uref{https://orgmode.org/worg/org-tutorials/org-jekyll.php, Ian Barton's Jekyll/blogging setup}}
es: @seealso{ @uref{https://orgmode.org/manual/Publishing.html#Publishing, Cap@'{@dotless{i}}tulo 13 del manual}@* @uref{https://orgmode.org/worg/org-tutorials/org-publish-html-tutorial.php, Tutorial de publicaci@'on de Sebastian Rose}@* @uref{https://orgmode.org/worg/org-tutorials/org-jekyll.php, Configuraci@'on de Jekyll de Ian Barton}}

source: Working with source code
es: Trabajando con c@'odigo fuente

source: Org-mode provides a number of features for working with source code, including editing of code blocks in their native major-mode, evaluation of code blocks, tangling of code blocks, and exporting code blocks and their results in several formats.
es: Org-mode proporciona un n@'umero de funcionalidades para trabajar con c@'odigo fuente, incluyendo la edici@'on de bloques c@'odigo en sus modo mayor nativo, evaluaci@'on de bloques c@'odigo, estructurar de bloques de c@'odigo, y exportar bloques de c@'odigo y sus resultados en varios formatos.

source: Structure of Code Blocks
es: Estructura de bloques de c@'odigo

source: The structure of code blocks is as follows:
es: La estructura de bloques de c@'odigo es como sigue:

source: Where @code{<name>} is a string used to name the code block, @code{<language>} specifies the language of the code block (e.g.@: @code{emacs-lisp}, @code{shell}, @code{R}, @code{python}, etc...), @code{<switches>} can be used to control export of the code block, @code{<header arguments>} can be used to control many aspects of code block behavior as demonstrated below, and @code{<body>} contains the actual source code.
es: Donde @code{<name>} es una cadena usada para nombrar el bloque de c@'odigo @code{<language>} que especifica el lenguaje del bloque de c@'odigo (por ej.@: @code{emacs-lisp}, @code{shell}, @code{R}, @code{python}, etc..., @code{<switches>} puede usarse para controlar la exportaci@'on del bloque de c@'odigo, @code{<header arguments>} puede usarse para controlar muchos aspectos del comportamiento de bloques de c@'odigo como se demuesta debajo, y el @code{<body>} contiene el c@'odigo fuente actual.

source: Editing source code
es: Editando c@'odigo fuente

source: Use @kbd{C-c '} to edit the current code block. This brings up a language major-mode edit buffer containing the body of the code block. Saving this buffer will write the new contents back to the Org buffer. Use @kbd{C-c '} again to exit the edit buffer.
es: Usa @kbd{C-c '} para editar el actual bloque de c@'odigo. Esto trae un lenguaje en modo mayor que edita el b@'uffer conteniendo el cuerpo del bloque de c@'odigo. Salvando este b@'uffer escribir@'a los nuevos contenidos atr@'as al b@'uffer de Org. Usa @kbd{C-c '} atr@'as para salir del b@'uffer de edici@'on.

source: Evaluating code blocks
es: Evaluando c@'odigos de bloques

source: Use @kbd{C-c C-c} to evaluate the current code block and insert its results in the Org-mode buffer. By default, evaluation is only turned on for @code{emacs-lisp} code blocks, however support exists for evaluating blocks in many languages. For a complete list of supported languages see the manual. The following shows a code block and its results.
es: Use @kbd{C-c C-c} para evaluar el actual bloque c@'odigo e inserte sus resultados en el b@'uffer de Org-mode. Por defecto, la evaluaci@'on solo cambia para bloques de c@'odigo @code{emacs-lisp}, sin embargo, el soporte existe para evaluar bloques en muchos lenguajes. Para una lista completa de lenguajes ver el manual. Lo siguiente muestra un bloque de c@'odigo y sus resultados.

source: Extracting source code
es: Extrayendo c@'odigo fuente

source: Use @kbd{C-c C-v t} to create pure source code files by extracting code from source blocks in the current buffer. This is referred to as ``tangling''---a term adopted from the literate programming community. During ``tangling'' of code blocks their bodies are expanded using @code{org-babel-expand-src-block} which can expand both variable and ``noweb'' style references. In order to tangle a code block it must have a @code{:tangle} header argument, see the manual for details.
es: Usa @kbd{C-c C-v t} para crear ficheros de c@'odigo fuente puro para extraer c@'odigo desde bloques fuente en el b@'uffer actual. Esto es referido como @emph{tagling} ``enredo''--- un t@'ermino adoptado desde la comunidad de programaci@'on literal. Durante ``el enredo'' de bloques c@'odigo sus cuerpos est@'an expandidas usando @code{org-babel-expand-src-block} que puede expandir ambas variables y referencias de estilo ``noweb''. En orden para enredar un bloque de c@'odigo ello debe tener un argumento de cabecera de @code{:tagling}, ver el manual para detalles.

source: Library of Babel
es: Librer@'{@dotless{i}}a de Babel

source: Use @kbd{C-c C-v l} to load the code blocks from an Org-mode files into the ``Library of Babel'', these blocks can then be evaluated from any Org-mode buffer. A collection of generally useful code blocks is distributed with Org-mode in @code{contrib/library-of-babel.org}.
es: Usa @kbd{C-c C-v l} para cargar los bloques de c@'odigo desde ficheros Org-mode dentro de la ``Librer@'{@dotless{i}}a de Babel'', estos bloques pueden ser evaluados desde cualquier b@'uffer Org-mode. Una colecci@'on de generalmente bloques de c@'odigo @'utiles est@'an distribuidos con Org-mode en @code{contrib/library-of-babel.org}.

source: Header Arguments
es: Argumentos de cabecera

source: Many aspects of the evaluation and export of code blocks are controlled through header arguments. These can be specified globally, at the file level, at the outline subtree level, and at the individual code block level. The following describes some of the header arguments.
es: Muchos aspectos de la evaluaci@'on y exportaci@'on de bloques c@'odigo est@'an controlados a trav@'es de argumentos de cabecera. Estos pueden ser especificados globalmente, en el nivel del fichero, en el nivel de perfil de sub@'arbol, y en el nivel de c@'odigo de bloque individual. Lo siguiente describe algunos de los argumentos de cabecera.

source: The @code{:var} header argument is used to pass arguments to code blocks. The values passed to arguments can be literal values, values from org-mode tables and literal example blocks, or the results of other named code blocks.
es: El argumento de cabecera @code{:var} es usado para pasar argumentos a bloques de c@'odigo. Los valores pasados a argumentos pueden ser valores literales, valores desde tablas org-mode y ejemplos de bloque literales, o los resultados de otros bloques de c@'odigo nombrados.
