Repository: bzg/worg
Catalog: orgguide/orgguide.*.po
Languages: es

source: The compact Org-mode Guide
es: La Gu@'{@dotless{i}}a compacta de Org-mode

source: @b{Further reading}@*@noindent \text\
es: @b{M@'as lecturas}@*@noindent \text\

source: Permission is granted to copy, distribute and/or modify this document under the terms of the GNU Free Documentation License, Version 1.3 or any later version published by the Free Software Foundation; with no Invariant Sections, with the Front-Cover Texts being ``A GNU Manual,'' and with the Back-Cover Texts as in (a) below. A copy of the license is included in the section entitled ``GNU Free Documentation License'' in the full Org manual, which is distributed together with the compact guide.
es: Permission is granted to copy, distribute and/or modify this document under the terms of the GNU Free Documentation License, Version 1.3 or any later version published by the Free Software Foundation; with no Invariant Sections, with the Front-Cover Texts being ``Un Manual GNU,'' and with the Back-Cover Texts as in (a) below. A copy of the license is included in the section entitled ``GNU Free Documentation License'' in the full Org manual, which is distributed together with the compact guide.

source: (a) The FSF's Back-Cover Text is: ``You have the freedom to copy and modify this GNU manual.''
es: (a) El texto de contraportada de la FSF es: ``Tu tienes la libertad para copiar y modificar este manual de GNU''.

source: Org Mode Guide: (orgguide)
es: Gu@'{@dotless{i}}a de Org-mode: (orgguide)

source: Abbreviated Org-mode Manual
es: Manual de Org-mode Abreviado

source: Release @value{VERSION}
es: Versi@'on @value{VERSION}

source: by Carsten Dominik
es: Por Carsten Dominik. Traducido por David Arroyo Men@'endez con contribuciones usuarios de emacs hispanohablantes. Dise@~no gr@'afico por Adolfo Antón Bravo.

source: Top
es: Arriba

source: Introduction
es: Introducci@'on

source: Org Mode Guide
es: Gu@'{@dotless{i}}a de Org Mode

source: Getting started
es: Comenzando

source: Document Structure
es: Estructura del documento

source: A tree works like your brain
es: Un @'arbol funciona como tu cerebro

source: Tables
es: Tablas

source: Pure magic for quick formatting
es: Pura magia para formatear r@'apido

source: Hyperlinks
es: Hiperenlaces

source: Notes in context
es: Notas en contexto

source: TODO Items
es: Elementos TODO

source: Every tree branch can be a TODO item
es: Cada rama del @'arbol puede ser un TODO

source: Tags
es: Etiquetas

source: Tagging headlines and matching sets of tags
es: Etiquetar cabeceras y encontrar etiquetas

source: Properties
es: Propiedades

source: Dates and Times
es: Fechas y horas

source: Making items useful for planning
es: Crear elementos @'utiles para planificar

source: Capture - Refile - Archive
es: Capturar - Rellenar - Archivar

source: The ins and outs for projects
es: Las entradas y salidas para proyectos

source: Agenda Views
es: Vistas de la Agenda

source: Collecting information into views
es: Recolectando informaci@'on en vistas

source: Markup
es: Marcado

source: Prepare text for rich export
es: Preparar texto para exportaci@'on enriquecida

source: Exporting
es: Exportando

source: Sharing and publishing of notes
es: Compartici@'on y publicaci@'on de notas

source: Publishing
es: Publicaci@'on

source: Create a web site of linked Org files
es: Crear un sitio web de ficheros Org enlazados

source: Working With Source Code
es: Trabajando con C@'odigo Fuente

source: Source code snippets embedded in Org
es: Trozos de c@'odigo fuente dentro de Org

source: Miscellaneous
es: Miscel@'anea

source: All the rest which did not fit elsewhere
es: El resto de cosas que no tienen otro lugar

source: This manual license.
es: Esta licencia de manual.

source: --- The Detailed Node Listing ---
es: --- El Listado Detallado de Nodos ---

source: Preface
es: Prefacio

source: Welcome
es: Bienvenida

source: Installation
es: Instalaci@'on

source: How to install a downloaded version of Org
es: C@'omo instalar una versi@'on descargada de Org

source: Activation
es: Activaci@'on

source: How to activate Org for certain buffers
es: C@'omo activar Org para ciertos buffers

source: Feedback
es: Realimentaci@'on

source: Bug reports, ideas, patches etc.
es: Informes de error, ideas, parches, etc.

source: Org is based on Outline mode
es: Org est@'a basado en el modo Outline

source: Headlines
es: Cabeceras

source: How to typeset Org tree headlines
es: C@'omo escribir un @'arbol de cabeceras Org

source: Visibility cycling
es: Visibilidad c@'{@dotless{i}}clica

source: Show and hide, much simplified
es: Mostrar y ocultar, muy simplificado

source: Motion
es: Movimiento

source: Jumping to other headlines
es: Saltando a otras cabeceras

source: Structure editing
es: Edici@'on de estructura

source: Changing sequence and level of headlines
es: Cambiando la secuencia y el nivel de cabeceras

source: Sparse trees
es: @'Arboles poco densos

source: Matches embedded in context
es: Correspondencias embebidas en contexto

source: Plain lists
es: Listas planas

source: Additional structure within an entry
es: Estructura adicional con una entrada

source: Footnotes
es: Notas al pie

source: How footnotes are defined in Org's syntax
es: C@'omo las notas al pie se definen en Org

source: Link format
es: Formato de enlace

source: How links in Org are formatted
es: C@'omo los enlaces son formateados en Org

source: Internal links
es: Enlaces internos

source: Links to other places in the current file
es: Enlaces a otros lugares en el fichero actual

source: External links
es: Enlaces externos

source: URL-like links to the world
es: Enlaces tipo URL para el mundo

source: Handling links
es: Manejando enlaces

source: Creating, inserting and following
es: Creando, insertando y siguiendo

source: Targeted links
es: Destinos enlazados

source: Point at a location in a file
es: Apuntando a una localizaci@'on en un archivo

source: Using TODO states
es: Usando los estados TODO

source: Setting and switching states
es: Poniendo y cambiado estados

source: Multi-state workflows
es: Flujos de trabajo multi-estado

source: More than just on/off
es: M@'as que si/no

source: Progress logging
es: Proceso de acceso

source: Dates and notes for progress
es: Fechas y notas para avanzar

source: Priorities
es: Prioridades

source: Some things are more important than others
es: Algunas cosas son m@'as importantes que otras

source: Breaking down tasks
es: Rompiendo tareas

source: Splitting a task into manageable pieces
es: Partiendo una tarea en piezas manejables

source: Checkboxes
es: Cajas de chequeo

source: Tick-off lists
es: Listas de marcas

source: Closing items
es: Cerrando @'{@dotless{i}}tems

source: When was this entry marked DONE?
es: ¿Cu@'ando se marc@'o a DONE?

source: Tracking TODO state changes
es: Trazando los estados TODO

source: When did the status change?
es: ¿Cuando cambia el estado?

source: Tag inheritance
es: Marca de herencia

source: Tags use the tree structure of the outline
es: Las marcas usan el @'arbol de outlines

source: Setting tags
es: Poniendo marcas

source: How to assign tags to a headline
es: C@'omo asignar etiquetas a una cabecera

source: Tag groups
es: Etiquetar grupos

source: Use one tag to search for several tags
es: Usar una etiqueta para buscar varias etiquetas

source: Tag searches
es: Buscando marcas

source: Searching for combinations of tags
es: Buscando combinaciones de etiquetas

source: Timestamps
es: Instante en el tiempo

source: Assigning a time to a tree entry
es: Asignaci@'on de tiempo a una entrada de @'arbol

source: Creating timestamps
es: Creando instantes de tiempo

source: Commands which insert timestamps
es: Comandos para insertar instantes de tiempo

source: Deadlines and scheduling
es: Fecha l@'{@dotless{i}}mite y planificaci@'on

source: Planning your work
es: Planificando tu trabajo

source: Clocking work time
es: Estableciendo tiempo de trabajo

source: Tracking how long you spend on a task
es: Llevar cuenta del gasto en una tarea

source: Capture
es: Capturar

source: Capturing new stuff
es: Capturando nuevas cosas

source: Refile and copy
es: Rellenar y copiar

source: Moving a tree from one place to another
es: Moviendo un @'arbol de un lugar a otro

source: Archiving
es: Archivando

source: What to do with finished projects
es: Qu@'e se hace con los proyectos terminados

source: Setting up a capture location
es: Poniendo una posici@'on de captura

source: Where notes will be stored
es: Donde ser@'an almacenadas las notas

source: Using capture
es: Usando capturas

source: Commands to invoke and terminate capture
es: Comandos para invocar y finalizar capturas

source: Capture templates
es: Plantillas para capturar notas

source: Define the outline of different note types
es: Define la idea de diferentes tipos de notas

source: Agenda files
es: Archivos de agenda

source: Files being searched for agenda information
es: Archivos buscados en la agenda

source: Agenda dispatcher
es: El disparador de la agenda

source: Keyboard access to agenda views
es: Acceso a las vistas de la agenda con teclado

source: Built-in agenda views
es: Vistas de agenda internas

source: What is available out of the box?
es: ¿Qu@'e hay fuera de la caja?

source: Agenda commands
es: Comandos de la agenda

source: Remote editing of Org trees
es: Edici@'on remota de @'arboles Org

source: Custom agenda views
es: Vistas de agenda personalizadas

source: Defining special searches and views
es: Definir b@'usquedas y vistas especiales

source: The built-in agenda views
es: Las vistas internas de la agenda

source: Weekly/daily agenda
es: Agenda semanal/diaria

source: The calendar page with current tasks
es: La p@'agina del calendario con las tareas

source: Global TODO list
es: Lista global TODO

source: All unfinished action items
es: Elementos de acciones sin finalizar

source: Matching tags and properties
es: Emparejar marcas y propiedades

source: Structured information with fine-tuned search
es: Informaci@'on con b@'usquedas afinadas

source: Timeline
es: L@'{@dotless{i}}nea de tiempo

source: Time-sorted view for single file
es: Vista ordenada en el tiempo de un archivo

source: Search view
es: Vista de b@'usqueda

source: Find entries by searching for text
es: Encontrando entradas buscando texto

source: Markup for rich export
es: Marcas para enriquecer la exportaci@'on

source: Structural markup elements
es: Elementos del marcado estructural

source: The basic structure as seen by the exporter
es: Estructura vista por el exportador

source: Images and tables
es: Im@'agenes y tablas

source: Images, tables and caption mechanism
es: Im@'agenes, tablas y mecanismo de caption

source: Literal examples
es: Ejemplos literales

source: Source code examples with special formatting
es: Ejemplos de c@'odigo fuente con formato especial

source: Include files
es: Archivos Include

source: Include additional files into a document
es: Archivos adicionales Include dentro de un documento

source: Embedded @LaTeX{}
es: @LaTeX{} embebido

source: @LaTeX{} can be freely used inside Org documents
es: @LaTeX{} puede usarse en documentos Org

source: Document title
es: T@'{@dotless{i}}tulo de documento

source: Where the title is taken from
es: Donde se toma el t@'{@dotless{i}}tulo

source: Headings and sections
es: Encabezados y secciones

source: The document structure as seen by the exporter
es: Estructura vista por el exportador

source: Table of contents
es: Tabla de contenidos

source: The if and where of the table of contents
es: El si y el donde de la tabla de contenidos

source: Paragraphs
es: P@'arrafos

source: Emphasis and monospace
es: @'Enfasis y monoespacio

source: Bold, italic, etc.
es: Negrilla, it@'alica, etc.

source: Comment lines
es: L@'{@dotless{i}}neas de comentarios

source: What will *not* be exported
es: Qu@'e *no* ser@'a exportado

source: Export options
es: Opciones de exportaci@'on

source: Per-file export settings
es: Configuraci@'ones del perfil de exportaci@'on

source: The export dispatcher
es: El dispensador de exportaci@'on

source: How to access exporter commands
es: Como acceder a comandos del exportador

source: ASCII/Latin-1/UTF-8 export
es: Exportaci@'on ASCII/Latin-1/UTF-8

source: Exporting to flat files with encoding
es: Exporta a ficheros con codificaci@'on

source: Exporting to HTML
es: Exportando a HTML

source: @LaTeX{} and PDF export
es: Exportar @LaTeX{} y PDF

source: Exporting to @LaTeX{}, and processing to PDF
es: Exportando a @LaTeX{}, y procesando a PDF

source: iCalendar export
es: Exportar iCalendar

source: Exporting to iCalendar
es: Exportando a iCalendar

source: Completion
es: Terminaci@'on

source: M-TAB knows what you need
es: M-TAB sabe qu@'e necesita

source: Clean view
es: Vista limpia

source: Getting rid of leading stars in the outline
es: Eliminar asteriscos iniciales en outline

source: MobileOrg
es: Org m@'ovil

source: Org-mode on the iPhone
es: Org-mode en el iPhone

source: Org is a mode for keeping notes, maintaining TODO lists, and doing project planning with a fast and effective plain-text system. It is also an authoring and publishing system, and it supports working with source code for literal programming and reproducible research.
es: Org es un modo Emacs para guardar notas, mantener listas TODO, y hacer planificaci@'on de proyectos con un r@'apido y efectivo sistema de texto plano. Es tambi@'en un sistema de publicaci@'on y autor@'{@dotless{i}}a, que soporta trabajar con c@'odigo fuente para programaci@'on literal e investigaci@'on reproducible.

source: This document is a much compressed derivative of the @uref{https://orgmode.org/index.html#sec-4_1, comprehensive Org-mode manual}. It contains all basic features and commands, along with important hints for customization. It is intended for beginners who would shy back from a 200 page manual because of sheer size.
es: Este documento es un resumen derivado del @uref{https://orgmode.org/index.html#sec-4-1, manual completo de Org-mode}. Contiene todas las funcionalidades b@'asicas y comandos, junto con importantes detalles de personalizaci@'on. Se recomienda para principiantes que se asustan con manuales de 200 p@'aginas solo por su tama@~no.

source: @b{Important:} @i{If you are using a version of Org that is part of the Emacs distribution or an XEmacs package, please skip this section and go directly to @ref{Activation}.}
es: @b{Importante:} @i{Si se usa una versi@'on de Org que es parte de una distribuci@'on de Emacs o un paquete de XEmacs, por favor s@'altese esta secci@'on y vaya directamente a @ref{Activaci@'on}.}

source: If you have downloaded Org from the Web, either as a distribution @file{.zip} or @file{.tar} file, or as a Git archive, it is best to run it directly from the distribution directory. You need to add the @file{lisp} subdirectories to the Emacs load path. To do this, add the following line to @file{.emacs}:
es: Si se ha descargado Org de la web, como distribuci@'on de ficheros bien @file{.zip}, o bien @file{.tar}, o como un archivo Git, es preferible ejecutarlo directamente desde el directorio de la distribuci@'on. Se pueden a@~nadir los subdirectorios @file{lisp} a la ruta que carga Emacs. Para hacer esto, se a@~nade la siguiente l@'{@dotless{i}}nea al archivo @file{.emacs}:

source: If you have been using git or a tar ball to get Org, you need to run the following command to generate autoload information. command:
es: Si ha estado usando git o un tar ball para obtener Org, debe ejecutar el siguiente comando para generar la informaci@'on de autocarga. Comando:

source: Add the following lines to your @file{.emacs} file. The last four lines define @emph{global} keys for some commands --- please choose suitable keys yourself.
es: A@~nada las siguientes l@'{@dotless{i}}neas a su archivo @file{.emacs}. Las @'ultimas cuatro l@'{@dotless{i}}neas definen las claves @emph{global} de algunos comandos ---por favor, elija claves apropiadas por s@'{@dotless{i}} mismo.

source: ;; The following lines are always needed. Choose your own keys. (global-set-key "\C-cl" 'org-store-link) (global-set-key "\C-ca" 'org-agenda) (global-set-key "\C-cc" 'org-capture) (global-set-key "\C-cb" 'org-iswitchb)
es: ;; Las siguiente l@'{@dotless{i}}neas son siempre necesarias. Elige ;; tus propias claves (global-set-key "\C-cl" 'org-store-link) (global-set-key "\C-ca" 'org-agenda) (global-set-key "\C-cc" 'org-capture) (global-set-key "\C-cb" 'org-iswitchb)

source: Files with extension @samp{.org} will be put into Org mode automatically.
es: Los ficheros con extensi@'on @samp{.org} llevar@'an el modo Org autom@'aticamente.

source: If you find problems with Org, or if you have questions, remarks, or ideas about it, please mail to the Org mailing list @email{emacs-orgmode@@gnu.org}. For information on how to submit bug reports, see the main manual.
es: Si se encuentra problemas con Org, o si tiene preguntas, comentarios, u otras ideas acerca de @'el, por favor env@'{@dotless{i}}e un correo a la lista de Org @email{emacs-orgmode@@gnu.org}. Para m@'as informaci@'on de c@'omo enviar informes de error, lea el manual principal.

source: Org is based on Outline mode and provides flexible commands to edit the structure of the document.
es: Org est@'a basado en el modo Outline y suministra comandos flexibles para editar la estructura de un documento.

source: Org is implemented on top of Outline mode. Outlines allow a document to be organized in a hierarchical structure, which (at least for me) is the best representation of notes and thoughts. An overview of this structure is achieved by folding (hiding) large parts of the document to show only the general document structure and the parts currently being worked on. Org greatly simplifies the use of outlines by compressing the entire show/hide functionality into a single command, @command{org-cycle}, which is bound to the @key{TAB} key.
es: Org est@'a implementado aprovechando el modo outline. Los @'{@dotless{i}}tems de contenido (outlines) permiten que el documento se organice en una estructura jer@'arquica, lo cual (al menos para m@'{@dotless{i}}) es la mejor forma para representar notas y pensamientos. Una visi@'on preliminar de esta estructura se logra al encoger (ocultar) grandes partes del documento y mostrar s@'olo la estructura general del documento y las partes en las que se est@'a trabajando. Org simplifica enormemente el uso de outlines para comprender la funcionalidad completa de mostrar/ocultar en un simple comando, @command{org-cycle}, el cual se asigna a la tecla @key{TAB}.

source: Headlines define the structure of an outline tree. The headlines in Org start with one or more stars, on the left margin@footnote{See the variable @code{org-special-ctrl-a/e} to configure special behavior of @kbd{C-a} and @kbd{C-e} in headlines.}. For example:
es: Las cabeceras@footnote{Nota del Traductor. Headlines es traducido por cabecera y hace referencia a t@'{@dotless{i}}tulos y subt@'{@dotless{i}}tulos} definen la estructura del @'arbol de sangrado (@'{@dotless{i}}tems de contenido). Los t@'{@dotless{i}}tulos y subt@'{@dotless{i}}tulos en Org comienzan con uno o m@'as asteriscos, en el margen izquierdo@footnote{Vea la variable @code{org-special-crtl-a/e} para configurar el comportamiento de @kbd{C-a} y @kbd{C-e} en los t@'{@dotless{i}}tulos.}. Por ejemplo:

source: * Top level headline ** Second level *** 3rd level some text *** 3rd level more text
es: * Cabecera de nivel superior ** Segundo nivel *** Tercer nivel cualquier texto *** Tercer nivel m@'as texto

source: * Another top level headline
es: * Otro t@'{@dotless{i}}tulo de nivel superior

source: Some people find the many stars too noisy and would prefer an outline that has whitespace followed by a single star as headline starters. @ref{Clean view}, describes a setup to realize this.
es: Algunas personas encuentran que tantos asteriscos molestan y preferir@'{@dotless{i}}an un @'{@dotless{i}}tem de contenido @samp{outline} que tenga un asterisco seguido de un espacio en blanco para comenzar cabeceras. M@'as adelante, en @ref{Vista limpia}, se describe una configuraci@'on para realizar esto.

source: Outlines make it possible to hide parts of the text in the buffer. Org uses just two commands, bound to @key{TAB} and @kbd{S-@key{TAB}} to change the visibility in the buffer.
es: Los outlines hacen posible ocultar partes del texto en el b@'uffer. Org usa solo dos comandos, asignados a @key{TAB} y @kbd{S-@key{TAB}}, para cambiar la visibilidad en el b@'uffer.

source: @emph{Subtree cycling}: Rotate current subtree among the states
es: @emph{Sub@'arbol c@'{@dotless{i}}clico}: Rotaci@'on en el sub@'arbol entre los estados

source: ,-> FOLDED -> CHILDREN -> SUBTREE --. '-----------------------------------'
es: ,-> ENCOGIDO -> HIJO -> SUB@'ARBOL --. '------------------------------------'

source: When called with a prefix argument (@kbd{C-u @key{TAB}}) or with the shift key, global cycling is invoked.
es: Cuando se llama con el argumento prefijo (@kbd{C-u @key{TAB}}) o con la tecla de desplazamiento (@kbd{Shift}), se invoca el ciclo global.

source: S-@key{TAB} @r{and} C-u @key{TAB}
es: S-@key{TAB} @r{y} C-u @key{TAB}

source: @emph{Global cycling}: Rotate the entire buffer among the states
es: @emph{Ciclo global}: Rotar el b@'uffer entero entre los estados

source: ,-> OVERVIEW -> CONTENTS -> SHOW ALL --. '--------------------------------------'
es: ,-> RESUMEN -> CONTENIDO -> MOSTRAR TODO --. '------------------------------------------ '

source: Show all, including drawers.
es: Mostrar todo, incluidos los calzoncillos

source: When Emacs first visits an Org file, the global state is set to OVERVIEW, i.e.@: only the top level headlines are visible. This can be configured through the variable @code{org-startup-folded}, or on a per-file basis by adding a startup keyword @code{overview}, @code{content}, @code{showall}, like this:
es: Cuando Emacs abre por primera vez un archivo Org, pone el estado global a RESUMEN (OVERVIEW) p.e.@: s@'olo las cabeceras de nivel superior son visibles. Esto puede configurarse a trav@'es de la variable @code{org-startup-folded}, o v@'{@dotless{i}}a fichero a@~nadiendo una palabra reservada @code{overview}, @code{content}, @code{showall}, como esta:

source: The following commands jump to other headlines in the buffer.
es: El siguiente comando salta a la siguiente cabecera en el b@'uffer.

source: Next heading.
es: Siguiente cabecera.

source: Previous heading.
es: Cabecera previa.

source: Next heading same level.
es: Siguiente cabecera del mismo nivel.

source: Previous heading same level.
es: Cabecera previa del mismo nivel.

source: Backward to higher level heading.
es: Retroceder a la cabecera de nivel superior.

source: Insert new heading with same level as current. If the cursor is in a plain list item, a new item is created (@pxref{Plain lists}). When this command is used in the middle of a line, the line is split and the rest of the line becomes the new headline@footnote{If you do not want the line to be split, customize the variable @code{org-M-RET-may-split-line}.}.
es: Inserta una nueva cabecera al mismo nivel que la actual. Si el cursor est@'a en un @'{@dotless{i}}tem de una lista plana, un nuevo @'{@dotless{i}}tem se crea (@pxref{Listas planas}). Cuando este comando se usa en medio de una l@'{@dotless{i}}nea, la l@'{@dotless{i}}nea se parte y el resto de la l@'{@dotless{i}}nea ser@'a una nueva cabecera@footnote{Si no desea que la l@'{@dotless{i}}nea se parta, personalice la variable @code{org-M-RET-may-split-line}.}.

source: Insert new TODO entry with same level as current heading.
es: Inserta una nueva entrada TODO con el mismo nivel de la cabecera actual.

source: @key{TAB} @r{in new, empty entry}
es: @key{TAB}
