Repository: bzg/worg
Catalog: orgguide/orgguide.*.po
Languages: es

source: Org mode allows you to clock the time you spend on specific tasks in a project.
es: Org mode permite contabilizar el tiempo que se gasta en tareas espec@'{@dotless{i}}ficas en un proyecto.

source: Start the clock on the current item (clock-in). This inserts the CLOCK keyword together with a timestamp. When called with a @kbd{C-u} prefix argument, select the task from a list of recently clocked tasks.
es: Comenzar a medir el tiempo en el @'{@dotless{i}}tem actual (@emph{clock-in}). Esto inserta la palabra clave CLOCK junto con una marca de tiempo. Cuando se llama con un argumento prefijo @kbd{C-u}, selecciona la tarea desde una lista de las tareas que recientemente se midi@'o el tiempo.

source: Stop the clock (clock-out). This inserts another timestamp at the same location where the clock was last started. It also directly computes the resulting time in inserts it after the time range as @samp{=> HH:MM}.
es: Parar el reloj, finalizar la medici@'on de tiempo (@emph{clock-out}). Esto inserta otra marca de tiempo en la misma localizaci@'on donde el reloj se inici@'o por @'ultima vez. Tambi@'en se computa directamente el tiempo resultante en insertarlo despu@'es del rango de tiempo @samp{=> HH:MM}.

source: Update the effort estimate for the current clock task.
es: Actualizar el esfuerzo de estimar la tarea para la actual medici@'on de reloj.

source: Cancel the current clock. This is useful if a clock was started by mistake, or if you ended up working on something else.
es: Cancela la medici@'on de reloj actual. Esto es @'util si el reloj fu@'e iniciado por error, o si se ya se finaliz@'o el trabajo.

source: Jump to the entry that contains the currently running clock. With a @kbd{C-u} prefix arg, select the target task from a list of recently clocked tasks.
es: Salta a la entrada que contiene el reloj actualmente en ejecuci@'on. Con un prefijo @kbd{C-u}, selecciona la tarea objetivo desde una lista de tareas recientemente cronometradas.

source: Insert a dynamic block containing a clock report as an Org-mode table into the current file. When the cursor is at an existing clock table, just update it.
es: Inserta un bloque din@'amico conteniendo un informe de tiempo de reloj como una tabla de Org-mode dentro del fichero actual. Cuando el cursor es una tabla de reloj existente, lo actualiza.

source: For details about how to customize this view, see @uref{https://orgmode.org/manual/Clocking-work-time.html#Clocking-work-time,the manual}.
es: Para detalles acerca de c@'omo personalizar esta vista, ver @uref{https://orgmode.org/manual/Clocking-work-time.html#Clocking-work-time, el manual}.

source: Update dynamic block at point. The cursor needs to be in the @code{#+BEGIN} line of the dynamic block.
es: Actualiza el bloque din@'amico a punto. El cursor necesita estar en la l@'{@dotless{i}}nea @code{#+BEGIN} del bloque din@'amico.

source: The @kbd{l} key may be used in the timeline (@pxref{Timeline}) and in the agenda (@pxref{Weekly/daily agenda}) to show which tasks have been worked on or closed during a day.
es: La tecla @kbd{l} puede ser usada en la l@'{@dotless{i}}nea de tiempo (@pxref{L@'{@dotless{i}}nea de tiempo}) y en la agenda (@pxref{Agenda semanal/diaria}) para mostrar las tareas en las que se trabajar@'a o cerrar@'an durante el d@'{@dotless{i}}a.

source: @seealso{ @uref{https://orgmode.org/manual/Dates-and-Times.html#Dates-and-Times, Chapter 8 of the manual}@* @uref{http://members.optusnet.com.au/~charles57/GTD/org_dates/, Charles Cave's Date and Time tutorial}@* @uref{http://doc.norang.ca/org-mode.html#Clocking, Bernt Hansen's clocking workflow}}
es: @seealso{ @uref{https://orgmode.org/manual/Dates-and-Times.html#Dates-and-Times, Cap@'{@dotless{i}}tulo 8 del manual}@* @uref{http://members.optusnet.com.au/~charles57/GTD/org_dates/, Tutorial de Fechas y Horas de Charles Cave}@* @uref{http://doc.norang.ca/org-mode.html#Clocking, Flujo de trabajo de cronomentrar de Bernt Hansen}}

source: An important part of any organization system is the ability to quickly capture new ideas and tasks, and to associate reference material with them. Org defines a capture process to create tasks. Once in the system, tasks and projects need to be moved around. Moving completed project trees to an archive file keeps the system compact and fast.
es: Una parte importante de cualquier organizaci@'on de sistemas es la habilidad para capturar nuevas ideas y tareas r@'apido, y asociar material de referencia con ellas. Org define un proceso de captura para crear tareas. En el sistema, puede surgir la necesidad de mover tareas y proyectos. Mover @'arboles de proyectos completos a un archivo deja el sistema compacto y r@'apido.

source: Org's lets you store quick notes with little interruption of your work flow. You can define templates for new entries and associate them with different targets for storing notes.
es: Org permite almacenar notas r@'apidas con peque@~nas interrupciones al quehacer cotidiano. Se pueden definir plantillas para nuevas entradas y asociarlos a diferentes objetivos para almacenar notas.

source: The following customization sets a default target@footnote{Using capture templates, you get finer control over capture locations, see @ref{Capture templates}.} file for notes, and defines a global key for capturing new stuff.
es: La siguiente personalizaci@'on configura un fichero objetivo por defecto@footnote{Usando plantillas de captura, se pueden definir localizaciones de grano m@'as fino, ver @ref{Plantillas para capturar notas}.} para notas y define un atajo global para capturar nuevas cosas.

source: Start a capture process, placing you into a narrowed indirect buffer to edit.
es: Comienza un proceso de captura, que deja dentro un estrecho b@'uffer indirecto para editar.

source: Once you are done entering information into the capture buffer, @kbd{C-c C-c} will return you to the window configuration before the capture process, so that you can resume your work without further distraction.
es: Una vez que se ha introducido informaci@'on dentro del b@'uffer de captura, @kbd{C-c C-c} devolver@'a a la ventana de configuraci@'on antes del proceso de captura, as@'{@dotless{i}} se puede resumir el trabajo sin distracci@'on.

source: Finalize by moving the entry to a refile location (see section 9.2).
es: Finaliza moviendo la entrada a una nueva localizaci@'on (ver secci@'on 9.2).

source: Abort the capture process and return to the previous state.
es: Abortar el proceso de captura y volver al estado previo.

source: You can use templates to generate different types of capture notes, and to store them in different places. For example, if you would like to store new tasks under a heading @samp{Tasks} in file @file{TODO.org}, and journal entries in a date tree in @file{journal.org} you could use:
es: Se pueden usar plantillas para generar diferentes formas de capturar notas y almacenarlas en diferentes lugares. Por ejemplo, si gusta almacenar nuevas tareas bajo una cabecera @samp{Tareas} en el fichero @file{TODO.org}, y art@'{@dotless{i}}culos de revistas en un @'arbol de fechas en @file{journal.org} se podr@'{@dotless{i}}a usar:

source: (setq org-capture-templates '(("t" "Todo" entry (file+headline "~/org/gtd.org" "Tasks") "* TODO %?\n %i\n %a") ("j" "Journal" entry (file+datetree "~/org/journal.org") "* %?\nEntered on %U\n %i\n %a")))
es: (setq org-capture-templates '(("t" "Todo" entry (file+headline "~/org/gtd.org" "Tareas") "* TODO %?\n %i\n %a") ("j" "Revistas" entry (file+datetree "~/org/journal.org") "* %?\nIntroducidas en %U\n %i\n %a")))

source: In these entries, the first string is the key to reach the template, the second is a short description. Then follows the type of the entry and a definition of the target location for storing the note. Finally, the template itself, a string with %-escapes to fill in information based on time and context.
es: En estas entradas, la primera cadena es la clave para lograr la plantilla, la segunda es una descripci@'on corta. Entonces sigue el tipo de la entrada y una definici@'on de la localizaci@'on del objetivo para almacenar la nota. Finalmente, la plantilla en s@'{@dotless{i}} misma, es una cadena con %-escapes para rellenar la informaci@'on basada en tiempo y contexto.

source: When you call @kbd{M-x org-capture}, Org will prompt for a key to select the template (if you have more than one template) and then prepare the buffer like
es: Cuando se llama a @kbd{M-x org-capture}, Org pregunta por una clave para seleccionar la plantilla (si se tiene m@'as de una plantilla) y entonces se prepara el b@'uffer as@'{@dotless{i}}:

source: * TODO [[file:@var{link to where you were when initiating capture}]]
es: * TODO [[file:@var{enlace a d@'onde se estaba inicializando la captura}]]

source: During expansion of the template, special @kbd{%}-escapes@footnote{If you need one of these sequences literally, escape the @kbd{%} with a backslash.} allow dynamic insertion of content. Here is a small selection of the possibilities, consult the manual for more.
es: Durante la expansi@'on de la plantilla, @kbd{%}-escapes@footnote{Si se necesita una de estas secuencias literalmente, escapa el @kbd{%} con una barra invertida.} especiales permiten la inserci@'on din@'amica de contenido. Aqu@'{@dotless{i}} una peque@~na selecci@'on de las posibilidades, consulte el manual para m@'as.

source: %a @r{annotation, normally the link created with @code{org-store-link}} %i @r{initial content, the region when capture is called with C-u.} %t, %T @r{timestamp, date only, or date and time} %u, %U @r{like above, but inactive timestamps}
es: %a @r{anotaci@'on, normalmente el enlace creado con @code{org-store-link}} %i @r{contenido inicial, la regi@'on cuando se captura se llama con C-u.} %t, %T @r{marca de tiempo, solo fecha, o fecha y tiempo} %u, %U @r{como el de debajo, pero con marcas de tiempo inactivas}

source: When reviewing the captured data, you may want to refile or copy some of the entries into a different list, for example into a project. Cutting, finding the right location, and then pasting the note is cumbersome. To simplify this process, use the following commands:
es: Cuando se revisa el dato capturado, se puede querer rellenar o copiar algunas de las entradas dentro de una lista diferente, por ejemplo, dentro de un proyecto. Cortando, encuentra la localizaci@'on correcta y entonces pegar la nota es complejo. Para simplificar este proceso, se pueden usar los siguientes comandos:

source: Copy the entry or region at point. This command behaves like @code{org-refile}, except that the original note will not be deleted.
es: Copiar la entrada o regi@'on. Este comando se comporta como @code{org-refile}, excepto que el original no ser@'a borrado.

source: Refile the entry or region at point. This command offers possible locations for refiling the entry and lets you select one with completion. The item (or all items in the region) is filed below the target heading as a subitem.@* By default, all level 1 headlines in the current buffer are considered to be targets, but you can have more complex definitions across a number of files. See the variable @code{org-refile-targets} for details.
es: Reajusta la entrada o regi@'on al punto. Este comando ofrece posibles localizaciones para reajustar la entrada y permite seleccionar una con autocompletado. El @'{@dotless{i}}tem (o todos los @'{@dotless{i}}tems en la regi@'on) se rellenan bajo el objetivo estructurado como sub@'{@dotless{i}}tem. @* Por defecto, todas las cabeceras de nivel 1 en el actual b@'uffer son consideradas para ser objetivos, pero se pueden tener definiciones m@'as complejas a trav@'es de un n@'umero de ficheros. Ver la variable @code{org-refile-targets} para detalles.

source: Use the refile interface to jump to a heading.
es: Usa el interfaz de reajuste para saltar a un encabezado.

source: Jump to the location where @code{org-refile} last moved a tree to.
es: Salta a la localizaci@'on d@'onde el @'ultimo @code{org-refile} se movi@'o a un @'arbol.

source: When a project represented by a (sub)tree is finished, you may want to move the tree out of the way and to stop it from contributing to the agenda. Archiving is important to keep your working files compact and global searches like the construction of agenda views fast. The most common archiving action is to move a project tree to another file, the archive file.
es: Cuando un proyecto se representa por un (sub)@'arbol y este se finaliza, se puede querer mover el @'arbol fuera del camino y hacer que no se contribuya a la agenda. Archivar es importante para guardar los ficheros de trabajo de b@'usquedas globales como la construcci@'on de vistas de agenda r@'apidas. La acci@'on m@'as com@'un de archivar es mover un @'arbol de proyecto a otro fichero, el fichero archivo.

source: Archive the current entry using @code{org-archive-default-command}.
es: Archivar la actual entrada usando el comando especificado en la variable @code{org-archive-default-command}.

source: C-c C-x C-s@ @r{or short} @ C-c $
es: C-c C-x C-s@ @r{o m@'as corto} @ C-c $

source: Archive the subtree starting at the cursor position to the location given by @code{org-archive-location}.
es: Archiva el sub@'arbol empezando en la posici@'on del cursor a la localizaci@'on dada por @code{org-archive-location}.

source: The default archive location is a file in the same directory as the current file, with the name derived by appending @file{_archive} to the current file name. For information and examples on how to change this, see the documentation string of the variable @code{org-archive-location}. There is also an in-buffer option for setting this variable, for example
es: La localizaci@'on del archivo por defecto es un fichero en el mismo directorio como el actual fichero, con el nombre derivado por el sufijo @file{_archive} al actual nombre de fichero. Para informaci@'on y ejemplos de c@'omo cambiar esto, ver la cadena de documentaci@'on de la variable @code{org-archive-location}. Hay tambi@'en una opci@'on de buffer para la configuraci@'on esta variable, por ejemplo

source: @seealso{ @uref{https://orgmode.org/manual/Capture-_002d-Refile-_002d-Archive.html#Capture-_002d-Refile-_002d-Archive, Chapter 9 of the manual}@* @uref{https://orgmode.org/worg/org-tutorials/org-protocol-custom-handler.php, Sebastian Rose's tutorial for capturing from a web browser}}@uref{}@*
es: @seealso{ @uref{https://orgmode.org/manual/Capture-_002d-Refile-_002d-Archive.html#Capture-_002d-Refile-_002d-Archive, Cap@'{@dotless{i}}tulo 9 del manual}@* @uref{https://orgmode.org/worg/org-tutorials/org-protocol-custom-handler.php, Sebastian Rose's tutorial para capturar desde un servidor web}}@uref{}@*

source: Due to the way Org works, TODO items, time-stamped items, and tagged headlines can be scattered throughout a file or even a number of files. To get an overview of open action items, or of events that are important for a particular date, this information must be collected, sorted and displayed in an organized way. There are several different views, see below.
es: Debido a que Org funciona, los @'{@dotless{i}}tems TODO, los @'{@dotless{i}}tems de marca de tiempo y las cabeceras pueden dispersarse a trav@'es de un fichero o incluso un n@'umero de ficheros. Para tener una visi@'on de @'{@dotless{i}}tems de acciones abiertas, o de eventos que son importantes para una fecha particular, esta informaci@'on debe ser recogida, ordenada y mostrada en un camino organizado. Hay vistas varias vistas diferentes, ver debajo.

source: The extracted information is displayed in a special @emph{agenda buffer}. This buffer is read-only, but provides commands to visit the corresponding locations in the original Org files, and even to edit these files remotely. Remote editing from the agenda buffer means, for example, that you can change the dates of deadlines and appointments from the agenda buffer. The commands available in the Agenda buffer are listed in @ref{Agenda commands}.
es: La informaci@'on extraida es mostrada en un @emph{b@'uffer de agenda} especial. Este b@'uffer es de solo lectura, pero proporciona comandos para visitar las localizaciones correspondientes en los ficheros Org originales, e incluso para editar estos ficheros remotamente. La edici@'on remota desde los b@'uffer de agenda significa, por ejemplo, que se pueden cambiar las fechas de entrega y citas desde el b@'uffer de agenda. Los comandos disponibles en el b@'uffer de Agenda son listados en @ref{Comandos de la agenda}.

source: The information to be shown is normally collected from all @emph{agenda files}, the files listed in the variable @code{org-agenda-files}.
es: La informaci@'on que se muestra est@'a normalmente recogida desde todos los @emph{ficheros de agenda}, los ficheros listados en la variable @code{org-agenda-files}.

source: Add current file to the list of agenda files. The file is added to the front of the list. If it was already in the list, it is moved to the front. With a prefix argument, file is added/moved to the end.
es: A@~nade el fichero actual a la lista de ficheros de agenda. El fichero se a@~nade al principio de la lista. Si ya estaba en la lista, se mueve al frente. Con un argumento de prefijo, el fichero se a@~nade/mueve al final.

source: Remove current file from the list of agenda files.
es: Borra el fichero actual desde la lista de ficheros de agenda.

source: Cycle through agenda file list, visiting one file after the other.
es: Cambia a trav@'es de la lista de ficheros de agenda, visitando un fichero despu@'es del otro.

source: The agenda dispatcher
es: El disparador de la agenda

source: The views are created through a dispatcher, which should be bound to a global key---for example @kbd{C-c a} (@pxref{Installation}). After pressing @kbd{C-c a}, an additional letter is required to execute a command:
es: Las vistas se crean a trav@'es de un disparador, que debería ser emparejado a una tecla global --- por ejemplo @kbd{C-c a} (@pxref{Instalaci@'on}). Despu@'es de presionar @kbd{C-c a}, se necesita una tecla adicional para ejecutar un comando:

source: The calendar-like agenda (@pxref{Weekly/daily agenda}).
es: La agenda como calendario (@pxref{Agenda semanal/diaria}).

source: A list of all TODO items (@pxref{Global TODO list}).
es: Una lista de todos los @'{@dotless{i}}tems TODO (@pxref{Lista global TODO}).

source: A list of headlines matching a TAGS expression (@pxref{Matching tags and properties}).
es: Una lista de titulares coincidentes con la expresi@'on TAGS (@pxref{Emparejar marcas y propiedades}).

source: The timeline view for the current buffer (@pxref{Timeline}).
es: La vista de la l@'{@dotless{i}}nea de tiempo para el b@'uffer actual @pxref{L@'{@dotless{i}}nea de tiempo}).

source: A list of entries selected by a boolean expression of keywords and/or regular expressions that must or must not occur in the entry.
es: Una lista de entradas seleccionadas por una expresi@'on booleana de palabras clave y/o expresiones regulares que deben o no deben coincidir con la entrada.

source: The weekly/daily agenda
es: Agenda semanal/diaria

source: The purpose of the weekly/daily @emph{agenda} is to act like a page of a paper agenda, showing all the tasks for the current week or day.
es: El prop@'osito de la @emph{agenda} semanal/diaria es actuar como una p@'agina de una agenda de papel, mostrando todas las tareas para la semana o d@'{@dotless{i}}a actual.

source: Compile an agenda for the current week from a list of Org files. The agenda shows the entries for each day.
es: Compila una agenda para la semana actual desde una lista de fichero Org. La agenda muestra las entradas para cada d@'{@dotless{i}}a.

source: Emacs contains the calendar and diary by Edward M. Reingold. Org-mode understands the syntax of the diary and allows you to use diary sexp entries directly in Org files:
es: Emacs contiene el calendario y el diario por Edward M. Reingold. Org-mode comprende la sintaxis del diario y permite usar las entradas sexp directamente en ficheros Org:

source: * Birthdays and similar stuff #+CATEGORY: Holiday %%(org-calendar-holiday) ; special function for holiday names #+CATEGORY: Ann %%(diary-anniversary 5 14 1956)@footnote{Note that the order of the arguments (month, day, year) depends on the setting of @code{calendar-date-style}.} Arthur Dent is %d years old %%(diary-anniversary 10 2 1869) Mahatma Gandhi would be %d years old
es: * Cumplea@~nos y cosas similares #+CATEGORY: Vacaciones %%(org-calendar-holiday) ; fuciones especiales para nombres de fiestas #+CATEGORY: Aniversario %%(diary-anniversary 5 14 1956)@footnote{N@'otese que el orden de los argumentos (mes, d@'{@dotless{i}}a, a@~no) depende de la configuraci@'on de @code{calendar-date-style}.} Arthur Dent tiene %d a@~nos %%(diary-anniversary 10 2 1869) Mahatma Gandhi tendr@'{@dotless{i}}a %d a@~nos.

source: Org can interact with Emacs appointments notification facility. To add all the appointments of your agenda files, use the command @code{org-agenda-to-appt}. See the docstring for details.
es: Org puede interactuar con la funcionalidad de notificaciones de citas de Emacs. Para a@~nadir todas la citas de tus ficheros de agenda, usa el comando @code{org-agenda-to-appt}. Ver la documentaci@'on para detalles.

source: The global TODO list
es: La lista global TODO

source: The global TODO list contains all unfinished TODO items formatted and collected into a single place. Remote editing of TODO items lets you can change the state of a TODO entry with a single key press. The commands available in the TODO list are described in @ref{Agenda commands}.
es: La lista global TODO contiene todos los @'{@dotless{i}}tems TODO formateados y recogidos en un lugar simple. La edici@'on remota de @'{@dotless{i}}tems TODO permite cambiar el estado de una entrada TODO con una simple tecla presionada. Los comandos disponibles en la lista TODO est@'an descritos en la @ref{Comandos de la agenda}.

source: Show the global TODO list. This collects the TODO items from all agenda files (@pxref{Agenda Views}) into a single buffer.
es: Muestra la lista global TODO. Esta colecci@'on de @'{@dotless{i}}tems TODO de todos los archivos de la agenda (@pxref{Vistas de la Agenda}) en un @'unico buffer.

source: Like the above, but allows selection of a specific TODO keyword.
es: Como abajo, pero permite la selecci@'on de una palabra clave TODO espec@'{@dotless{i}}fica.

source: If headlines in the agenda files are marked with @emph{tags} (@pxref{Tags}), or have properties (@pxref{Properties}), you can select headlines based on this metadata and collect them into an agenda buffer. The match syntax described here also applies when creating sparse trees with @kbd{C-c / m}. The commands available in the tags list are described in @ref{Agenda commands}.
es: Si las l@'{@dotless{i}}neas de cabecera en los ficheros de agenda est@'an marcados con @emph{etiquetas} (@pxref{Etiquetas}), o tienen propiedades (@pxref{Propiedades}), se pueden seleccionar l@'{@dotless{i}}neas de cabecera basadas en estos metadatos y se recogen dentro del b@'uffer de agenda. El emparejamiento de sintaxis descrito aqu@'{@dotless{i}} tambi@'en se aplica cuando se crean @'arboles encogidos con @kbd{C-c / m}. Los comandos disponibles en la lista de etiquetas est@'an descritos en la @ref{Comandos de la agenda}.
